{
  "invalidTitles": [
    {
      "id": 1523,
      "title": "Link https kelley iu edu programs undergrad pre-college ywi html The New York",
      "description": "City Department of Housing Develoment & Preservation Summer."
    },
    {
      "id": 1518,
      "title": "Link https docs google com forms d e 1FAIpQLSeOIOis6O_niGSJKDO1zbvIdGjyATcrdR",
      "description": "Link: https://docs.google.com/forms/d/e/1FAIpQLSeOIOis6O_niGSJKDO1zbvIdGjyATcrdR - High-quality opportunity extracted from Stuyvesant Student Opportunity Bulletin with comprehensive details available."
    },
    {
      "id": 1514,
      "title": "Link https innovation nfte com how-to- compete _gl 1 l7q94r _ga NDU0MjMyOTMz",
      "description": "LjE3MTgyMDY1ODg.*_ga_DGM46Z4NVN*MT cxODI1NDg5NC4zLjEuMTcxODI1NTg5NS4wLjAuMA."
    },
    {
      "id": 1510,
      "title": "Rapidly-approaching application deadlines https docs google com document d 1m",
      "description": "rapidly-approaching application deadlines: https://docs.google.com/document/d/1m - High-quality opportunity extracted from Stuyvesant Student Opportunity Bulletin with comprehensive details available."
    },
    {
      "id": 1508,
      "title": "Links https collegenow baruch cuny edu https collegenow baruch cuny edu wp",
      "description": "-content/uploads/sites/31/2025/05/Fall-2025-Process-Guide-."
    },
    {
      "id": 1507,
      "title": "500 Grand Concourse",
      "description": "Location: , Bronx (in-person) or Virtual (asynchronous and synchronous)."
    },
    {
      "id": 1505,
      "title": "Link https www bike nyc education programs summer-programs Event Approaching",
      "description": ": Girls Write Now Salon Series - Writing the Places That Save Us “Sometimes, the places we love are the spaces that allow us to create community. Sometimes, the places we love are the spaces keeping us alive. Join Reese’s Book Club LitUp Fellow Arriel Vinson as she discusses her debut YA novel, Unde."
    },
    {
      "id": 1494,
      "title": "2026 school year program",
      "description": "PARKS/NATURE: Rooted in the City is a 2025- that teached students about the incredible variety of plant life in the city. It pays a stipend."
    },
    {
      "id": 1493,
      "title": "Before the relevant deadlines, which may be during",
      "description": "the summer. For students still seeking summer opportunities, Community Service is one area in which a substantial number of options remain available. Check that section: for example, all students may help disadvantaged younger students at P.S. 188 on the."
    },
    {
      "id": 1492,
      "title": "And all can enjoy the summer outdoors by working with one of the many NYC Park program",
      "description": "lower East Side of Manhattan (application deadline: June 15th!), s available in the PARKS/NATURE section. Some other highlights from this week’s edition:."
    },
    {
      "id": 1491,
      "title": "COMMUNITY SERVICE",
      "description": ": The historic ship Lilac is moored on the Hudson River, two blocks north of Stuyvesant, and it welcomes student volunteers to help with a variety of tasks – weekend shifts are mandatory. And various summer tutoring options may be accessed at the link found at the beginning of this section."
    },
    {
      "id": 1490,
      "title": "Link https www navalhorizons us Event Approaching Girls Write Now Salon",
      "description": "Series - Writing the Places That Save Us “Sometimes, the places we love are the spaces that allow us to create community. Sometimes, the places we love are the spaces keeping us alive. Join Reese’s Book Club LitUp Fellow Arriel Vinson as she discusses her debut YA novel, Under the Neon Lights, and e."
    },
    {
      "id": 1489,
      "title": "Https www usdan org summer-camp programs classic-program https www usdan org",
      "description": "https://www.usdan.org/summer-camp/programs/classic-program https://www.usdan.org - High-quality opportunity extracted from Stuyvesant Student Opportunity Bulletin with comprehensive details available."
    },
    {
      "id": 1485,
      "title": "Links https fs22 formsite com nycc r9g0xfcwyz index https www nycitycenter",
      "description": "org/community-engagement/preludes-summer-teen-theater-intensive/."
    },
    {
      "id": 1479,
      "title": "Links https drexel edu cci student-experience summer-programs https drexel",
      "description": ".edu/~/media/Files/cci/docs/Student_Experience/Digital-Development-."
    },
    {
      "id": 1474,
      "title": "And Architecture program",
      "description": "Links: https://www.putneyschool.org/summer/ https://www.putneyschool.org/summer/how-to-apply/ For a list of some Art, Museum, s, check this link: https://docs.google.com/document/d/16cq0U9s-Kb9bT78wl2qxsQcEItNB9Glh/edit."
    },
    {
      "id": 1472,
      "title": "17 live in dormitories for four weeks on campus to attend creative workshop",
      "description": "each July to make art, write, and create community. Students ages 14-s and community building. Workshops include animation, ceramics, dance, farming, filmmaking illustration, life drawing, metal jewelry, painting, printmaking, sculpture, songwriting, theater, vocal ensemble, weaving, and writing sto."
    },
    {
      "id": 1471,
      "title": "The Putney School Summer Arts Program",
      "description": "New: “Join us to hear about this hilltop in Vermont where teens, artists, and writers gather."
    },
    {
      "id": 1465,
      "title": "Links https www fxbclimateadvocates org https www fxbclimateadvocates org",
      "description": "apply Application Link: https://docs.google.com/forms/d/e/1FAIpQLSeMAu002VVllHc6aeTY3mV_0714kuG LywJ04SI1nOg_HBThGw/viewform."
    },
    {
      "id": 1462,
      "title": "Links https www bklynlibrary org support volunteer teen-techies https www b",
      "description": "klynlibrary.org/support/volunteer/t4/form Hospital Volunteer Opportunities."
    },
    {
      "id": 1460,
      "title": "Link https drive google com file d 1P3iu-GBSTQD30uy7csP89ul_qAlYB6fd view usp",
      "description": "=sharing Events Approaching: Upcoming Museum of Mathematics Student Volunteer Opportunities."
    },
    {
      "id": 1459,
      "title": "Link https www wscah org volunteer https www newyorkcares org search fullt",
      "description": "Link: https://www.wscah.org/volunteer/ https://www.newyorkcares.org/search?fullt - High-quality opportunity extracted from Stuyvesant Student Opportunity Bulletin with comprehensive details available."
    },
    {
      "id": 1457,
      "title": "Links https www doingwit org classes https docs google com forms d e 1FAIpQ",
      "description": "LSevchbT5XZuy- _HoIC8nXiyG4GdKlRsStZkBUDPus_Z9M6kpQ/viewform?mc_cid=43a75817a6&m c_eid=5465a95457 https://docs.google.com/forms/d/e/1FAIpQLSc0q36E-2e5-- 0KZ9XBU3EegbTyh8ISLvnUkw1ISoEMvp8Thw/viewform."
    },
    {
      "id": 1454,
      "title": "Link https www fordham edu gabelli-school-of-business academic-programs-and-",
      "description": "admissions/undergraduate-programs/specialty-programs/summer-business-programs/finance-."
    },
    {
      "id": 1452,
      "title": "Link https investin org collections our- programmes filter p m product_filter",
      "description": "s.age=Ages+15-18 For information about obtaining Working Papers at Stuyvesant, check this link: https://docs.google.com/document/d/1hawnkPcYfJu_C_Zy0D10AO1Jn5BAKFI8/edit For a list of some business-related programs & opportunities, click on this link: https://docs.google.com/document/d/1BnK3YA8bSM-z."
    },
    {
      "id": 1438,
      "title": "The internship",
      "description": "is designed as a well-rounded experience that touches on all aspects of what we do — social media, press and storytelling, public engagement, and event planning for senior leadership. Interns gain hands-on experience drafting content, helping shape communications strategies, supporting public events."
    },
    {
      "id": 1425,
      "title": "And academic workshop",
      "description": "textbooks, school supplies, s. Submit a complete application to Mhernandez@citytech.cuny.edu."
    },
    {
      "id": 1422,
      "title": "Link https girlswritenow org event june8-special-event Event Approaching Gi",
      "description": "rls Write Now Salon Series - Writing the Places That Save Us “Sometimes, the places we love are the spaces that allow us to create community. Sometimes, the places we love are the spaces keeping us alive. Join Reese’s Book Club LitUp Fellow Arriel Vinson as she discusses her debut YA novel, Under th."
    },
    {
      "id": 1421,
      "title": "Link https www eventbrite com e saturday-science-manhattanville-community-day",
      "description": "Link: https://www.eventbrite.com/e/saturday-science-manhattanville-community-day - High-quality opportunity extracted from Stuyvesant Student Opportunity Bulletin with comprehensive details available."
    },
    {
      "id": 1414,
      "title": "700 stipend for those who complete the program",
      "description": "includes a $. And, for the weeks ahead, all students may volunteer to help candidates for different NYC government offices – two new options (for the Manhattan District Attorney and Borough President races) are now listed in this section."
    },
    {
      "id": 1413,
      "title": "In Manhattan welcomes applications from current 9th, 10th,",
      "description": "and 11th graders with an interest in history, research, and museum work. It runs on Wednesday afternoons, and."
    },
    {
      "id": 1407,
      "title": "Link https www octaviaproject org join-the-octavia-project-summer-institute",
      "description": "For a list of several Writing Opportunities, check this link: https://docs.google.com/document/d/1lT3cNpmmbC0qvOpjKgvN_GGK5RfutbNm/edit."
    },
    {
      "id": 1406,
      "title": "Link https www gilderlehrman org student-opportunities david-mccullough-essay",
      "description": "- Breakthrough Junior Challenge Video Contest “You’ve grasped an important scientific theory, concept or principle. Now can you share your insight? An inventive video can get across complex material that would take pages of text to communicate. To take part in the Breakthrough Junior Challenge, crea."
    },
    {
      "id": 1395,
      "title": "Links https www bklynlibrary org support volunteer teen-techies https www b",
      "description": "klynlibrary.org/support/volunteer/t4/form Math Gym at the Museum of Mathematics “Students will spend an hour independently working on engaging and beautiful math problems, hand-selected by MoMath’s advisory council of math PhDs. Choose whichever challenges you like and explore them with the guidance."
    },
    {
      "id": 1394,
      "title": "Links https urbanarts org game-academy-summer-course https docs google com",
      "description": "/forms/d/e/1FAIpQLScKm8s3Jtc1Tt7KvNlEtMEbMvJ1celAbWKNcCjCNzl 7nQYh2g/viewform Brooklyn Public Library Teen Techies “Do you love technology and your library? Want to make a difference in your community? Looking to build your resume and gain valuable work and leadership."
    },
    {
      "id": 1387,
      "title": "Links https joyofcoding eecs umich edu https joyofcoding eecs umich edu ap",
      "description": "Links: https://joyofcoding.eecs.umich.edu/ https://joyofcoding.eecs.umich.edu/ap - High-quality opportunity extracted from Stuyvesant Student Opportunity Bulletin with comprehensive details available."
    },
    {
      "id": 1384,
      "title": "Links https www summertech net summertech courses https www summertech net",
      "description": "Links: https://www.summertech.net/summertech/courses/ https://www.summertech.net - High-quality opportunity extracted from Stuyvesant Student Opportunity Bulletin with comprehensive details available."
    },
    {
      "id": 1380,
      "title": "And develop AI program",
      "description": "Inspirit AI students will explore applications, create foundational AI concepts, ming skills before developing a Social Good project. No prior programming or computer science background is required, but an interest in AI is appreciated!”."
    },
    {
      "id": 1374,
      "title": "Links https wyckoffmuseum org garden-apprentice-program https docs google",
      "description": "com/forms/d/e/1FAIpQLSfDfq_813bC0vY32pLchIJR8IKj- ego4hrDBSYVzqJAfZbpCg/viewform."
    },
    {
      "id": 1373,
      "title": "The Youth Garden Apprentice Program",
      "description": "“ (GAP) provides first-hand experience cultivating organic vegetables, herbs, flowers, and perennials on our 1.25 acre site. The garden includes raised beds for seasonal vegetables and medicinal herbs, as well as fruit and nut trees, wildflowers, roses, and native plants. You will learn alongside qu."
    },
    {
      "id": 1368,
      "title": "Link https admissions upenn edu visit-connect penn-perspectives peep Events A",
      "description": "Link: https://admissions.upenn.edu/visit-connect/penn-perspectives/peep Events A - High-quality opportunity extracted from Stuyvesant Student Opportunity Bulletin with comprehensive details available."
    },
    {
      "id": 1354,
      "title": "Links https www bklynlibrary org support volunteer teen-techies https www b",
      "description": "klynlibrary.org/support/volunteer/t4/form Events Today & Approaching: Upcoming Museum of Mathematics Student Volunteer Opportunities."
    },
    {
      "id": 1351,
      "title": "Link https www smarts4heart com about-1 Brooklyn Public Library Teen Techies",
      "description": "“Do you love technology and your library? Want to make a difference in your community? Looking to build your resume and gain valuable work and leadership."
    },
    {
      "id": 1348,
      "title": "Link https drive google com file d 1P3iu-GBSTQD30uy7csP89ul_qAlYB6fd view usp",
      "description": "Link: https://drive.google.com/file/d/1P3iu-GBSTQD30uy7csP89ul_qAlYB6fd/view?usp - High-quality opportunity extracted from Stuyvesant Student Opportunity Bulletin with comprehensive details available."
    },
    {
      "id": 1347,
      "title": "The Lilac, a historic ship docked at Pier",
      "description": "25 just north of the school, welcomes student interns to help during the spring & summer months. Volunteers will be trained to meet and greet visitors, talk about the ship’s history, and assist in other ways. Part-time spots are available. Volunteers must be available on weekends. To learn more and ."
    },
    {
      "id": 1345,
      "title": "Month program",
      "description": "the end of the 10-, students will gain real-world work experience with organizations such as Google, Meta, Airbnb, the United Nations, and Mastercard, be future-ready with a good understanding of emerging technologies such as Artificial."
    },
    {
      "id": 1336,
      "title": "Link https www eventbrite com e manhattan-anti-prom-tickets- 1306912272789 af",
      "description": "f=nyplwebsite&_gl=1*l1ckxf*_gcl_au*MTU2NjEzMTU0My4xNzQyOTY3MjAz."
    },
    {
      "id": 1321,
      "title": "The Senior Summer Success Camp",
      "description": "2- provides similar support services, and meets twice a week for one month in Manhattan."
    },
    {
      "id": 1318,
      "title": "COMMUNITY SERVICE",
      "description": ": The Lilac, an historic ship located at Pier 25 (near Stuyvesant) welcomes student volunteers in June and over the summer – all are welcome to serve as greeters, especially on weekends. The Brooklyn Public Library welcomes all students to volunteer as Teen Techies, a."
    },
    {
      "id": 1316,
      "title": "CUNY College",
      "description": "And in addition to the summer term, free Now college-level courses at various CUNY campuses around the city, many of these schools have opened."
    },
    {
      "id": 1314,
      "title": "The deadline to apply for free summer College",
      "description": "Now courses at BMCC (across the street from Stuyvesant) is June 1st – rising juniors & seniors are eligible to apply. https://bmcccuny.iad1.qualtrics.com/jfe/form/SV_9TYp3ufOVRCxwk6."
    },
    {
      "id": 1311,
      "title": "Many deadlines are fast approaching",
      "description": "- Here are a few examples of the excellent opportunities & programs to be found in the sections below:."
    },
    {
      "id": 1310,
      "title": "Necessary application form may be obtained from Mr",
      "description": "Myles Sebastien (who can explain the procedure and answer any questions) in the Stuyvesant Guidance Office (Room 236) between 8:00am – 3:30pm. If you are selected for or enroll in any of the above opportunities, please inform Mr. Blumm ASAP at: hblumm@stuy.edu."
    },
    {
      "id": 1308,
      "title": "The Ultimate Scholarship",
      "description": "Spreadsheet Resource “Our spreadsheet houses an extensive array of scholarships, complete with filters to help students quickly identify the opportunities that best suit their needs. Updated weekly, it highlights the top ten scholarships of the month, ensuring you never miss out on lucrative funding."
    },
    {
      "id": 1299,
      "title": "The Pasta Rose Scholarship",
      "description": "“ is a yearly scholarship awarded to Brooklyn high school students who have lost a parent to cancer. Having the strength and resilience to go on."
    },
    {
      "id": 1287,
      "title": "Link https www turnup us turnup-tech Application Link https docs google co",
      "description": "m/forms/d/e/1FAIpQLSc3TVLKsgwC1Lf2BaPtQB5EAtU8THNGrc- Bj3MPbcTxoIjaPw/viewform."
    },
    {
      "id": 1285,
      "title": "The TurnUp Civic Tech Challenge welcomes folks under",
      "description": "age 26 to share their idea for a civic technology project that will promote youth voter registration, turnout, or."
    },
    {
      "id": 1284,
      "title": "Link https charter jotform com 211444483735053 TurnUp Civic Tech Challenge",
      "description": "Link: https://charter.jotform.com/211444483735053 TurnUp Civic Tech Challenge - High-quality opportunity extracted from Stuyvesant Student Opportunity Bulletin with comprehensive details available."
    },
    {
      "id": 1281,
      "title": "Link https www duckbrand com stuck-at-prom faqs Bow Seat s Ocean Awareness Co",
      "description": "ntest “For the 2025 Contest, we encourage you to explore the natural world and your place in it. We invite you to think about your unique connection to nature and how being outside makes you feel. become a climate witness and share your own unique climate story. Go through the sub-themes and explore."
    },
    {
      "id": 1278,
      "title": "Link https www tdf org school-and-community-programs tdf-education- programs",
      "description": "Link: https://www.tdf.org/school-and-community-programs/tdf-education- programs/ - High-quality opportunity extracted from Stuyvesant Student Opportunity Bulletin with comprehensive details available."
    },
    {
      "id": 1275,
      "title": "Link http irttheater org programs westside-experiment https www eventbrite",
      "description": ".com/e/a-westside-experiment-young-actors-laboratory-summer-2025-tickets- 1063525376029?aff=oddtdtcreator Theater Development Fund’s Graduation Gift “TDF has a special gift to all graduating seniors from NYC’s public and charter high."
    },
    {
      "id": 1256,
      "title": "The Sheen Center",
      "description": "Location: (18 Bleecker Street, Manhattan) Cost: Free."
    },
    {
      "id": 1255,
      "title": "Links https www nytw org education mind-the-gap https airtable com appwtDb",
      "description": "Links: https://www.nytw.org/education/mind-the-gap/ https://airtable.com/appwtDb - High-quality opportunity extracted from Stuyvesant Student Opportunity Bulletin with comprehensive details available."
    },
    {
      "id": 1254,
      "title": "The goals of the program",
      "description": "“ are both to teach writing and theatre skills and foster better communication and understanding between these two age groups: Adolescents &."
    },
    {
      "id": 1238,
      "title": "Links https events humanitix com tap-animated-storytelling-group https www",
      "description": "theanimationproject.org/animated-storytelling-groups."
    },
    {
      "id": 1233,
      "title": "Link https www stonybrook edu commcms lichtenstein-center community- programs",
      "description": "Link: https://www.stonybrook.edu/commcms/lichtenstein-center/community- programs - High-quality opportunity extracted from Stuyvesant Student Opportunity Bulletin with comprehensive details available."
    },
    {
      "id": 1230,
      "title": "The YAWP Summer Workshop",
      "description": "school students on Zoom in July and August. s will pair seasoned adult writers with students for workshops in fiction, personal narrative, poetry, playwriting and screenwriting."
    },
    {
      "id": 1229,
      "title": "Links https breakthroughjuniorchallenge org challenge https breakthroughjun",
      "description": "Links: https://breakthroughjuniorchallenge.org/challenge https://breakthroughjun - High-quality opportunity extracted from Stuyvesant Student Opportunity Bulletin with comprehensive details available."
    },
    {
      "id": 1223,
      "title": "Link https fs22 formsite com nycc uafg5cokbb index The Open Stage Project Act",
      "description": "One & Act Two Behind the Scenes Production “Open Stage offers two free opportunities for female & non-binary students: Act One is a single 90-minute interactive panel led by entertainment professionals to learn about behind-the-scenes careers."
    },
    {
      "id": 1221,
      "title": "The New York City Center Externship Program",
      "description": "“ introduces students and young adults to the many career options available to them in the arts, focusing on creative, technical, design, and administrative arts jobs. Utilizing breaks in the NYC public."
    },
    {
      "id": 1218,
      "title": "Links http www nychealthandhospitals org volunteering http www nychealthan",
      "description": "dhospitals.org/hospitals/ https://docs.google.com/document/d/15q4GlI8MdbZ- k8EpK2U3fRYFQK7Pcewp/edit?usp=sharing&ouid=111212941873538043271&rtpof=true&sd=tru."
    },
    {
      "id": 1217,
      "title": "The Margaret Tietz Nursing & Rehabilitation Center",
      "description": "“ in Queens offers high school students the opportunity to work as summer volunteers in a residential/medical setting this summer. There will be a variety of in-person helping opportunities, with weekday."
    },
    {
      "id": 1216,
      "title": "Links https www the-iyrc org medicalhumanities html https docs google com f",
      "description": "orms/d/e/1FAIpQLSdkq2NZbbo0vWh2TbGo3frQEQFSxibmvCyXdSwxK XCuQTjB9g/viewform."
    },
    {
      "id": 1214,
      "title": "Links https www tribecapediatrics com about-us community-giving https docs",
      "description": ".google.com/forms/d/e/1FAIpQLScyakLd3xUW2hJwabtH- a_zwVBliD471_ZQgeb2btrUpV627A/viewform International Young Researchers’ Conference Medical Humanities and Public."
    },
    {
      "id": 1202,
      "title": "Links https www dronesined com camps https drive google com file d 1olomjtf",
      "description": "Links: https://www.dronesined.com/camps https://drive.google.com/file/d/1olomjtf - High-quality opportunity extracted from Stuyvesant Student Opportunity Bulletin with comprehensive details available."
    },
    {
      "id": 1198,
      "title": "Links https joyofcoding eecs umich edu https joyofcoding eecs umich edu ap",
      "description": "ply/ Math Gym at the Museum of Mathematics “Students will spend an hour independently working on engaging and beautiful math problems, hand-selected by MoMath’s advisory council of math PhDs. Choose whichever challenges you like and explore them with the guidance and mentorship of an expert mathemat."
    },
    {
      "id": 1194,
      "title": "Links https mathprize atfoundation org apply https mathprize atfoundation o",
      "description": "rg/apply/apply-online https://mathprize.atfoundation.org/."
    },
    {
      "id": 1192,
      "title": "Links https drive google com file d 1frlgu1nw15pjDM2K- 4wf5B8zWx5erHCa view u",
      "description": "sp=sharing https://docs.google.com/forms/d/e/1FAIpQLSfSjZVMWiKPxJHsyImbIq8l1qSSsR3le1CFubUMkWj xjt1Ktw/viewform."
    },
    {
      "id": 1185,
      "title": "The school year, including corporate partnerships with AT&T,",
      "description": "the school year, including corporate partnerships with AT&T, - High-quality opportunity extracted from Stuyvesant Student Opportunity Bulletin with comprehensive details available."
    },
    {
      "id": 1179,
      "title": "Links https www americaontech org tech360 html https www americaontech org",
      "description": "uploads/1/2/7/6/127666989/2025_tech360_1-pager.pdf."
    },
    {
      "id": 1174,
      "title": "Links https urbanarts org game-academy-summer-course https docs google com",
      "description": "/forms/d/e/1FAIpQLScKm8s3Jtc1Tt7KvNlEtMEbMvJ1celAbWKNcCjCNzl 7nQYh2g/viewform For a list of several Computer Science Opportunities, check this link: https://docs.google.com/document/d/1y7o7rO9o_uVO_ccZWAwZcMnZraKoU1Cd/edit For a list of several Math Opportunities, check this link: https://docs.googl."
    },
    {
      "id": 1166,
      "title": "The UCLA Game Lab Summer Institute",
      "description": "“ introduces high school students to game making as a form of artistic practice, teaching them the techniques and tools that will help them develop analog and digital games that reflect their own creative voice and."
    },
    {
      "id": 1157,
      "title": "Https noguchieducation wufoo com forms 2025-making-your-mark-application Teen",
      "description": "Reviewers and Critics (TRaC) Spring 2025 “TRaC is a series of opportunities in the visual arts, music, theater, dance, media, multi-arts and film.Over ten weeks, participants learn the language of each art discipline while seeing shows and meeting professional artists. After each experience students."
    },
    {
      "id": 1150,
      "title": "The New School Parsons Online Summer Intensive",
      "description": "Studies “Study art and design from anywhere in the world in this four-week, three-credit."
    },
    {
      "id": 1144,
      "title": "Links https whitney org education teens youth-insights https whitneyedu wuf",
      "description": "Links: https://whitney.org/education/teens/youth-insights https://whitneyedu.wuf - High-quality opportunity extracted from Stuyvesant Student Opportunity Bulletin with comprehensive details available."
    },
    {
      "id": 1141,
      "title": "Links https www newmuseum org learn for-teens https forms office com pages",
      "description": "/responsepage.aspx?id=ZNcBYodvjky2oMuzm2hlT0Ca6QNLJ_VIpj YMgm-KYadUQzdFTDVLMVBJMlpINkgzTUxENENMNUVGMy4u&route=shorturl."
    },
    {
      "id": 1139,
      "title": "The Fellowship",
      "description": "amplifies youth voices and ideas by supporting large-scale projects, including a public display of their artwork and a Youth Summit.”."
    },
    {
      "id": 1138,
      "title": "16 an hour while working directly with professional",
      "description": "artists, Museum staff, and community members, and gaining creative and professional development through mentorship, work experience, and leadership opportunities."
    },
    {
      "id": 1137,
      "title": "The Fellowship",
      "description": "public high school students. spans two school years, allowing time for Fellows to develop their creativity, critical thinking, and self-expression. They earn."
    },
    {
      "id": 1135,
      "title": "Link https engage metmuseum org events education celebrations festivals fy25",
      "description": "celebrate-the-new-michael-c- rockefeller- wing/?_gl=1*1pr299i*_gcl_au*MTk3NjkzMTM3My4xNzQ2MTUzMDI2*_ga*OTM2Njk2ODk2LjE3NDYxNTMwMj Y.*_ga_Y0W8DGNBTB*czE3NDc4NDMyMjkkbzIkZzEkdDE3NDc4NDMyNzkkajAkbDAkaDA."
    },
    {
      "id": 1130,
      "title": "The School of Visual Arts offers various course",
      "description": "“s including animation, cartooning, interior design, etc. Students will have the opportunity to enhance their creative skills, learn about a particular field of art, and develop their portfolios. This year, there is an in-person option offered for students, as well as virtual courses. Three credits ."
    },
    {
      "id": 1127,
      "title": "The Summer Arts Dorill Program",
      "description": "“ provides a structured, supportive space for young people to explore multiple art forms, work alongside experienced teaching artists, and connect with peers in a creative environment.”."
    },
    {
      "id": 1123,
      "title": "The President s Volunteer Service Award, as JEP is",
      "description": "a certifying organization. Through JEP, students can virtually earn volunteer hours while advocating for youth voices in the public policy sphere.”."
    },
    {
      "id": 1121,
      "title": "Link https summer uchicago edu courses parrhesia-ambassador-program Environm",
      "description": "ental Justice Youth Steering Committee “We act for Environmental Justice and to expand access to interdisciplinary, justice- centered climate and resilience education in New York's K-12 schools through the Climate and Resilience Education Task Force's (CRETF's) Youth Steering Committee (YSC)! The CR."
    },
    {
      "id": 1110,
      "title": "The Staten Island Justice Center",
      "description": "“ is offering a paid internship for high school students residing in Staten Island. Students will receive community service hours, a paid."
    },
    {
      "id": 1105,
      "title": "Links https turnup us internship https docs google com document d 1M0Jvri8M",
      "description": "UeZDtL_S__d9tY0BanJkMRoRyHl0NrA0/edit Application Link: https://docs.google.com/forms/d/1XhCTCrn8jdSN3r10ehH9DrsRtYZ_YnU6FdSJM6NVePw/viewf orm?edit_requested=true#responses."
    },
    {
      "id": 1100,
      "title": "Link https www griptape org Teen Service Corps",
      "description": "Link: https://www.griptape.org/ Teen Service Corps - High-quality opportunity extracted from Stuyvesant Student Opportunity Bulletin with comprehensive details available."
    },
    {
      "id": 1098,
      "title": "Link https www nveee org pals Griptape Learning Challenge The GripTape Lear",
      "description": "ning Challenge provides you with financial support to pursue an interest or learn something you’re passionate about. In addition to funding, GripTape pairs you with a Champion to support you throughout your 10-week Learning Challenge. A Champion is a person who believes in you no matter what and is ."
    },
    {
      "id": 1093,
      "title": "Link https youngmindsinmotion com careers Peace Ambassador Leadership Summit",
      "description": "(PALS) “The Peace Ambassador Leadership Summit (PALS) is a transformative, seven-day."
    },
    {
      "id": 1092,
      "title": "Teaching profession To start the application process, email",
      "description": "your resume to Niyasha James at niyashaj@youngmindsinmotion.com ”."
    },
    {
      "id": 1035,
      "title": "Link https www williams edu admission-aid wow Events Approaching",
      "description": "Link: https://www.williams.edu/admission-aid/wow/ Events Approaching: - High-quality opportunity extracted from Stuyvesant Student Opportunity Bulletin with comprehensive details available."
    },
    {
      "id": 1031,
      "title": "For a general list of program",
      "description": "s (mostly free) that provide college admissions information and support to seniors and students from other grades, check this link: https://docs.google.com/document/d/1r7ryz-sPk9bdvhc6NlKoWoBNlLVg2Y00/edit."
    },
    {
      "id": 1029,
      "title": "Links http www nychealthandhospitals org volunteering http www nychealthan",
      "description": "dhospitals.org/hospitals/ https://docs.google.com/document/d/15q4GlI8MdbZ- k8EpK2U3fRYFQK7Pcewp/edit?usp=sharing&ouid=111212941873538043271&rtpof=true&sd=true NYC Service Opportunities Resource “You're not just a part of your city, you're shaping its future. Now's your chance to get involved, have f."
    },
    {
      "id": 1021,
      "title": "Link https generabridge wixsite com generabridge Events Approaching Upcomin",
      "description": "g Museum of Mathematics Student Volunteer Opportunities."
    },
    {
      "id": 1013,
      "title": "Link https lunaparknyc com jobs Khan s Tutorial Tutoring Jobs We are",
      "description": "looking to hire graduating seniors for in-person tutoring positions across various branches (we have locations in Brooklyn, Manhattan, Queens, and the Bronx). Positions include Common Core instructors, SHSAT instructors, GPA/Regents instructors, and SAT instructors. The pay varies per position. Work."
    },
    {
      "id": 1005,
      "title": "Link https www girlswithimpact org register US Open Ball Crew Paid Jobs",
      "description": "“The Ball Crew is a one-of-a-kind team that plays a vital role in the tournament. Each team member is responsible for ensuring a smooth transition of play from mastering the art of rolling to servicing the players’ needs throughout a match. Throughout the three weeks, they are running the sidelines ."
    },
    {
      "id": 989,
      "title": "579 per course",
      "description": "Cost: $2,, additional $640 for housing, dining, and application fees (no financial aid)."
    },
    {
      "id": 978,
      "title": "Link https www nysscpa org nextgen high-school-students coap co-ap- locations",
      "description": "#sthash.P5NnbuER.GVskYRQK.dpbs Application Link: https://forms.office.com/pages/responsepage.aspxid=YcqJiToq8E2xM0toa_tzqMnWcNhI5xJMksLt5e66qc5UMkhZSEc 4S1JSN005R1FTU08yNUk1RTNJRCQlQCN0PWcu&route=shorturl."
    },
    {
      "id": 972,
      "title": "And all students may apply for a summer internship with the political camp",
      "description": "aign of Manhattan City Councilwoman Virginia Maloney – flexible schedules are available."
    },
    {
      "id": 968,
      "title": "The NYC Center",
      "description": "THEATER/ARTS: in Manhattan welcomes applications from all students for their free one-week Technical/Design/Administrative Externship, which introduces participants to behind-the-scenes careers in thetare and entertainment venues. And the Open Stage Project’s Act One and Act Two programs teach femal."
    },
    {
      "id": 966,
      "title": "And leadership program",
      "description": "“All students may register for these free sessions, which teach career and college admissions preparation skills and knowledge. They also offer free sports, recreational, s on Saturday evenings. And free SAT prep programs will also be available later this spring. To learn more, contact Ms Brittney R."
    },
    {
      "id": 963,
      "title": "Day program",
      "description": "one-, participants get to join workshops that feature top faculty members. The YWI gives participants access to current business students and alumni, a chance to explore a real-world business case project, build leadership and communication skills, and connect with like-minded women interested in bu."
    },
    {
      "id": 955,
      "title": "Http www tomorrowsbusinessleaders org studentapplication http www tomorrowsb",
      "description": "http://www.tomorrowsbusinessleaders.org/studentapplication http://www.tomorrowsb - High-quality opportunity extracted from Stuyvesant Student Opportunity Bulletin with comprehensive details available."
    },
    {
      "id": 942,
      "title": "The fellowship",
      "description": "will consist of two virtual sessions involving discussions with other fellows and Yale students on various ethical philosophies and dilemmas, and an in-."
    },
    {
      "id": 939,
      "title": "Link https www nationalhistoryacademy org the-academy rising-10th-12th-grade-",
      "description": "Link: https://www.nationalhistoryacademy.org/the-academy/rising-10th-12th-grade- - High-quality opportunity extracted from Stuyvesant Student Opportunity Bulletin with comprehensive details available."
    },
    {
      "id": 936,
      "title": "The Intro to Calculus program",
      "description": "“ aims to support students who either: a) do not feel challenged enough in schools; b) plan to study a Math-intensive major in colleges, such as science, engineering, social-science-related majors (Psychology, Quantitative Sociology, Education Studies, etc.), or business-related majors (Finance, Acc."
    },
    {
      "id": 934,
      "title": "Links https www qcc cuny edu collegeNow summer html https www qcc cuny edu",
      "description": "collegeNow/docs/CN_Robotics_Summer_25.pdf https://www.qcc.cuny.edu/collegeNow/faqs.html."
    },
    {
      "id": 933,
      "title": "In teams in person on the QCC Camp",
      "description": "us to design, construct and program autonomous mobile robots. Students will demonstrate what they have learned at a showcase on August 4th.”."
    },
    {
      "id": 923,
      "title": "The Science and Technology Entry Program",
      "description": "“ (STEP) provides students from 7th through 12th grade with enrichment classes, financial aid workshops, health professions training, social justice education, and mentorship. Activities take place."
    },
    {
      "id": 919,
      "title": "For a full list of summer College",
      "description": "Now programs at campuses around the city, check this link: https://docs.google.com/document/d/15idkCwTw2uzCGOE01ZQaVdaKKBLGQ2yN5zZu9MuAQX."
    },
    {
      "id": 918,
      "title": "For a list of Fall 2025",
      "description": "New: College Now programs at campuses around the city, check this link: https://docs.google.com/document/d/1uhOZKsNC2SX9s3b7WCcZUquZ6rJZm8SCtWzoYmtjMQ4/."
    },
    {
      "id": 897,
      "title": "The Urban Barcode Biology Research at the New York College",
      "description": "of Technology in downtown Brooklyn engages students in studies of biodiversity using DNA technology. It runs from August to May and is open to applicants from all grades – the."
    },
    {
      "id": 895,
      "title": "CUNY campuses have opened applications for their fall term College",
      "description": "Now classes in both STEM and Humanities fields. There are varying eligibility requirements, check this section to learn more. GOVERNMENT/LEADERSHIP/HISTORY: The Sadie Nash Summer Leadership."
    },
    {
      "id": 894,
      "title": "Sections below many deadlines are fast-approaching, so",
      "description": "interested students should explore these options and apply ASAP!"
    },
    {
      "id": 893,
      "title": "The Queensborough Community College",
      "description": "’s summer Robotics Program is open to current sophomores and juniors, interested students should apply ASAP."
    },
    {
      "id": 892,
      "title": "For the list of only the New and",
      "description": "Deadline Approaching opportunities in each category, you may click & open the “Short” version of the Student Opportunity document you (Download this entire PDF document in order to use the following links to jump to your area(s) of interest)."
    },
    {
      "id": 891,
      "title": "Academic Program",
      "description": "opportunities in a variety of fields. Please carefully note deadlines, age requirements, and other pre-requisites for participation. For ease of use, these newsletters are organized by different categories, such as s, Business Internships & Jobs, STEM Opportunities, Community Service, and so on. Ple."
    },
    {
      "id": 890,
      "title": "The HERricane Summer Session",
      "description": "is a free one-week July program in Brooklyn for female students interested in emergency management and natural –disaster response techniques."
    },
    {
      "id": 887,
      "title": "The Summer Justice Institute",
      "description": "is a free one-week program at two local federal courthouses that provides an up-close look at various components of the legal system to current 9th, 10th, and 11th graders."
    },
    {
      "id": 886,
      "title": "The NYU Journalism Institute",
      "description": "is offering a free seven-day summer workshop to students with an interest in journalism. Participants will attend an intensive and."
    },
    {
      "id": 885,
      "title": "Links https cims nyu edu gstem about-us https cims nyu edu gstem apply ht",
      "description": "tps://cims.nyu.edu/gstem/financial-aid-and-scholarships/."
    },
    {
      "id": 883,
      "title": "Week program",
      "description": "science, physics, and psychology. During this three-, students will participate in lectures and labs led by some of the world's leading scientists at NYU, offering a unique opportunity to learn and network directly from some of today's most innovative researchers in the field.”."
    },
    {
      "id": 880,
      "title": "Link https www eventbrite com e 32nd-annual-latino-college-expo-leadership- s",
      "description": "ummit-2025-tickets-1051653021497?aff=erelexpmlt Event Approaching:."
    },
    {
      "id": 875,
      "title": "Links https www niddk nih gov research-funding research-programs diversity- p",
      "description": "rograms/research-training-opportunities-students/step-up#where-do-i-conduct-my- https://www.niddk.nih.gov/research-funding/research-programs/diversity-programs/research- training-opportunities-students/step-up/eligibility-requirements."
    },
    {
      "id": 874,
      "title": "Link https www sps nyu edu high-school-academy programs weekend- workshops ht",
      "description": "Link: https://www.sps.nyu.edu/high-school-academy/programs/weekend- workshops.ht - High-quality opportunity extracted from Stuyvesant Student Opportunity Bulletin with comprehensive details available."
    },
    {
      "id": 865,
      "title": "Link https jasna org programs essay-contest Naval Horizons Essay Contest Th",
      "description": "is contest challenges students to picture themselves in a STEM career by designing the U.S. Navy and Marine Corps of the future. Watch the videos to learn about U.S. Navy and Marine Corps STEM research areas and our people. Choose one of the STEM topics highlighted in the videos, conduct additional ."
    },
    {
      "id": 863,
      "title": "Links https bowseat org programs ocean-awareness-contest contest-overview ht",
      "description": "tps://bowseat.org/programs/ocean-awareness-contest/how-to-enter Naval Horizons Essay Contest “This contest challenges students to picture themselves in a STEM career by designing the U.S. Navy and Marine Corps of the future. Watch the videos to learn about U.S. Navy and Marine Corps STEM research ar."
    },
    {
      "id": 835,
      "title": "The Timbuctoo Climate Science and Careers Institute",
      "description": "“ provides high school students going into their sophomore and junior year with a two-week summer experience exploring the foundations of climate science and the careers dedicated to and intersecting with the environment. Students will collaborate with faculty from SUNY."
    },
    {
      "id": 834,
      "title": "And the Sadie Nash Summer Leadership Institute",
      "description": "is a summer program focused on students who identify as women or gender expansive. ART/MUSEUMS: The Whitney Museum’s Youth Insights three-week summer."
    },
    {
      "id": 830,
      "title": "The Louis August Jonas Foundation Ethical Leadership Experience Summer Program",
      "description": "Updated : “For two weeks, join an intimate virtual international cohort for a highly interactive exploration of leadership, identity, justice, action, and imagination. Explore some of the most fascinating open problems outside of the standard curriculum, from robot judges to sustainable futures.”."
    },
    {
      "id": 828,
      "title": "Links https www inspiringgirls org https www inspiringgirls org about-appl",
      "description": "y Project True Project True is a paid summer and fall urban ecology project that allows current 11th grade students who are Bronx residents to work as field social science research."
    },
    {
      "id": 814,
      "title": "The FFAC National High School Mentorship program is an online summer program",
      "description": "“ with the Factory Farming Awareness Coalition (FFAC) for a nine-week time commitment. Students from around the US will learn more about the impacts of factory farming, engage in active discussion, and participate in a variety of social change-making projects and nonprofit work.”."
    },
    {
      "id": 813,
      "title": "The NYU Summer Career Edge Program",
      "description": "“ affords students an exceptional college and career readiness experience. Explore career paths and experience what it is like to live."
    },
    {
      "id": 810,
      "title": "The Summer Design Institute",
      "description": "BUSINESS/CAREERS: is a free group of summer programs offered at several high schools around the city. Engineering, fashion, game,."
    },
    {
      "id": 807,
      "title": "And college preparatory workshop",
      "description": "in math, science, SAT, s. High school students will be taking courses in Anatomy & Physiology Behavioral, Neuroscience Biomedical Research, Coding in Snap (Block-based programming) Environmental Sustainability, Social Psychology.”."
    },
    {
      "id": 805,
      "title": "The New York Botanical Garden Explainer internship program",
      "description": "provides students 14- 17 years old with an opportunity to learn about plant science, leadership skills, public speaking, and more. Participants gain work skills experience through teaching science and nature studies to children in a beautiful and supportive setting."
    },
    {
      "id": 803,
      "title": "The Scripps Translational Institute Student Research Internship Program",
      "description": "The Scripps Translational Institute Student Research Internship Program - High-quality opportunity extracted from Stuyvesant Student Opportunity Bulletin with comprehensive details available."
    },
    {
      "id": 802,
      "title": "Programs high-school-programs college-access-leadership-institute html https c",
      "description": "programs/high-school-programs/college-access-leadership-institute.html https://c - High-quality opportunity extracted from Stuyvesant Student Opportunity Bulletin with comprehensive details available."
    },
    {
      "id": 801,
      "title": "Link https research princeton edu about-us internships laboratory-learning- M",
      "description": "ath Gym at the Museum of Mathematics “Students will spend an hour independently working on engaging and beautiful math problems, hand-selected by MoMath’s advisory council of math PhDs. Choose whichever challenges you like and explore them with the guidance and mentorship of an expert mathematician."
    },
    {
      "id": 800,
      "title": "Links https www nycitycenter org education career-programs high-school- exter",
      "description": "nships/ https://fs22.formsite.com/nycc/uafg5cokbb/index Stossel in the Classroom Essay Contest “Students can submit an essay of 500 to 1,000 words on one of four topics: The Effect of Minimum Wage on Entry-Level Workers: A Better Immigration System; Cancel Culture or Censorship – Is it an assault on."
    },
    {
      "id": 795,
      "title": "Scholarship",
      "description": "based organizations. Topics covered include admissions basics, financial aid, college costs, s, and more. At the leadership summit, you will exchange thoughts and ideas to learn about effective academic and leadership strategies to implement at."
    },
    {
      "id": 793,
      "title": "The High School Research Program",
      "description": "“, a six-week educational program for students interested in pursuing science, technology, engineering and mathematics (STEM) studies, provides access to a real-world scientific community and research experience.”."
    },
    {
      "id": 788,
      "title": "The Dragon Hearts Foundation College Scholarship",
      "description": "“ Fund is committed to supporting exceptional female students facing financial challenges, in particular those pursuing."
    },
    {
      "id": 786,
      "title": "200 students each year from grades seven through",
      "description": "college prepare for careers in science and health care. As a unit of Mount Sinai Health System's Office for Diversity."
    },
    {
      "id": 785,
      "title": "The Junior Academy",
      "description": "“ is a virtual community of international students ages 13-17 who are passionate about science, technology, engineering and math (STEM), and committed to making a difference in the world."
    },
    {
      "id": 782,
      "title": "The Octavia Project Summer Institute",
      "description": "“ is a free five-week-long program for people who are into science fiction/fantasy and interested in workshops that combine art, writing, science, and tech. Participants will create an online multimedia portfolio; strengthen skills in digital-media, art, and writing; and have access to a network of ."
    },
    {
      "id": 767,
      "title": "The Global Leaders Academy",
      "description": "“ is a six-week summer program designed to expose young change-makers who are English Language Learners and immigrant students to the United Nations Sustainable Development Goals (UN SDGs), while helping them develop their leadership, language, and other critical 21st century skills including Artifi."
    },
    {
      "id": 765,
      "title": "Link https precollege sps columbia edu programs summer-programs columbia-writ",
      "description": "ing-academy- summer?utm_campaign=PREC- GC_SU25_DL10&utm_content=Precollege&utm_medium=Internal&utm_source=Email&utm_term=SHGEN5."
    },
    {
      "id": 750,
      "title": "And humanities course",
      "description": "s. The program features lab tours, social events, and college admissions counseling, allowing participants to explore the rewards of STEM education and careers. Through MITES Summer, students develop both academic and personal skills essential for success in higher education and beyond.”."
    },
    {
      "id": 748,
      "title": "Links https www sps nyu edu high-school-academy programs career-edge html htt",
      "description": "ps://connect.nyu.edu/register/careeredge25 US Open Ball Crew Paid Jobs “The Ball Crew is a one-of-a-kind team that plays a vital role in the tournament. Each team member is responsible for ensuring a smooth transition of play from mastering the art of rolling to servicing the players’ needs througho."
    },
    {
      "id": 730,
      "title": "The Forest Hills Summer Youth",
      "description": "COLLEGE PREP: Several free or low-cost summer programs (virtual and /or in- person) are available; some are focused on rising seniors, and some accept all GOVERNMENT/LEADERSHIP/HISTORY:."
    },
    {
      "id": 724,
      "title": "Link https www eventbrite com e materials-madness-at-columbia-tickets-1320079",
      "description": "406039 New York Hall of Science STEM Career Expo “Join us for an exciting in-person event that aims to bring together STEM organizations, colleges, universities, professionals, and companies to provide high."
    },
    {
      "id": 716,
      "title": "The JFK Redevelopment Aviation and Aeronautics Academy at York College",
      "description": "“ (JFKR AAA) aims to expose local youth to science, technology, engineering, and math concepts related to aviation, aeronautics, and airport management, as well as to introduce them to leadership and career opportunities in the industry. In partnership."
    },
    {
      "id": 710,
      "title": "The generous Atlas Scholarship",
      "description": "BUSINESS: /Paid Summer Internship program for under-resourced and/or under-represented students interested in business majors & careers is accepting applicatiuons until March 3rd . And the Museum of Finance."
    },
    {
      "id": 697,
      "title": "The Summit STEM Fellowship",
      "description": "“ (SSF) is a virtual summer program empowering the next generation of leaders in STEM. Explore diverse opportunities and career pathways in STEM, learn from a network of 50+ mentors from Harvard, Stanford, and."
    },
    {
      "id": 696,
      "title": "CUNY campuses have opened applications for their fall term College",
      "description": "Now classes in both STEM and Humanities fields. There are varying eligibility requirements, check this section to learn more. GOVERNMENT/LEADERSHIP/HISTORY: The Sadie Nash Summer Leadership."
    },
    {
      "id": 623,
      "title": "Women's Western Golf Foundation will accept applications from girls who are actively participating in the sport of Golf. 3.5 GPA. Show character, integrity and leadership in Resume.",
      "description": "Women's Western Golf Foundation will accept applications from girls who are actively participating in the sport of Golf. 3.5 GPA. Show character, integrity and leadership in Resume. - A scholarship opportunity for high school students. Research this scholarship online for official application details, requirements, and deadlines. Verify eligibility criteria and application procedures on the official website."
    },
    {
      "id": 618,
      "title": "2021 Side Hustlin' Student Scholarship Opportunity",
      "description": "2021 Side Hustlin' Student Scholarship Opportunity - A scholarship opportunity for high school students. Research this scholarship online for official application details, requirements, and deadlines. Verify eligibility criteria and application procedures on the official website."
    },
    {
      "id": 615,
      "title": "4-H Youth in Action Awards",
      "description": "4-H Youth in Action Awards - A scholarship opportunity for high school students. Research this scholarship online for official application details, requirements, and deadlines. Verify eligibility criteria and application procedures on the official website."
    },
    {
      "id": 603,
      "title": "The Right  to Trial Scholarship",
      "description": "The Right  to Trial Scholarship - A scholarship opportunity for high school students. Research this scholarship online for official application details, requirements, and deadlines. Verify eligibility criteria and application procedures on the official website."
    },
    {
      "id": 600,
      "title": "The Hagan Scholarship",
      "description": "The Hagan Scholarship - A scholarship opportunity for high school students. Research this scholarship online for official application details, requirements, and deadlines. Verify eligibility criteria and application procedures on the official website."
    },
    {
      "id": 574,
      "title": "The College JumpStart Scholarship",
      "description": "The College JumpStart Scholarship - A scholarship opportunity for high school students. Research this scholarship online for official application details, requirements, and deadlines. Verify eligibility criteria and application procedures on the official website."
    },
    {
      "id": 516,
      "title": "The Generation Google Scholarship",
      "description": "The Generation Google Scholarship - A scholarship opportunity for high school students. Research this scholarship online for official application details, requirements, and deadlines. Verify eligibility criteria and application procedures on the official website."
    },
    {
      "id": 454,
      "title": "The National Latin Exam is excited to continue its New Latin Educators Scholarship",
      "description": "The National Latin Exam is excited to continue its New Latin Educators Scholarship - A scholarship opportunity for high school students. Research this scholarship online for official application details, requirements, and deadlines. Verify eligibility criteria and application procedures on the official website."
    },
    {
      "id": 453,
      "title": "The Linda S. Montross New Latin Educators Scholarship",
      "description": "The Linda S. Montross New Latin Educators Scholarship - A scholarship opportunity for high school students. Research this scholarship online for official application details, requirements, and deadlines. Verify eligibility criteria and application procedures on the official website."
    },
    {
      "id": 404,
      "title": "The Life Lessons Scholarship Program",
      "description": "The Life Lessons Scholarship Program - A scholarship opportunity for high school students. Research this scholarship online for official application details, requirements, and deadlines. Verify eligibility criteria and application procedures on the official website."
    },
    {
      "id": 377,
      "title": "The May Firm Scholarship",
      "description": "The May Firm Scholarship - A scholarship opportunity for high school students. Research this scholarship online for official application details, requirements, and deadlines. Verify eligibility criteria and application procedures on the official website."
    },
    {
      "id": 138,
      "title": "ISSYP",
      "description": "Two‑week residential (also online) physics program at Perimeter Institute, featuring quantum computing, cosmology, and mentorship."
    }
  ],
  "invalidDescriptions": [
    {
      "id": 1511,
      "title": "SummerProgram",
      "description": "Links: http://www.fusionacademy.com/summer-classes-for-credit/ https://www.fusionacademy.com/summer-programs/#s Harvard Student Agencies Weekend Junior Academies/Summer & Fall Terms “The Academies @HOME offers weekend programs curated by Harvard faculty and taught by undergraduates to help students ."
    },
    {
      "id": 1500,
      "title": "Application Link",
      "description": ": https://summit.pioneeracademics.com/en/registration- form_gl=1*770s3x*_gcl_au*MTI5MDAxNjk0OS4xNzQ3ODM5MzAx."
    },
    {
      "id": 1449,
      "title": "Ce_pre_collegiate_classes_long_island_course",
      "description": "Application Deadline: Rolling Basis https://www.hofstra.edu/academics/ce/s."
    },
    {
      "id": 1433,
      "title": "Viewform For a list of some other free summer STEP programs at several camp",
      "description": "Link: https://hostosproyectoaccess.org/step Application Link: https://docs.google.com/forms/d/e/1FAIpQLSfIH9jGjMfrbVdLTEpyq4L9GtL- eBUixv_BIkCTEreGQ899Ug/uses around the city, check this link: https://docs.google.com/document/d/10NSP_kqUna7pcZEY8g6LA1D_JgcwV0gb/edit."
    },
    {
      "id": 1430,
      "title": "Fusion Academy",
      "description": "Application Deadline: June 23 https://www.hvcc.edu/programs/highschool/cihs/offerings/online-summer.html New:."
    },
    {
      "id": 1400,
      "title": "Rosettainstitute",
      "description": "Links: https://www..org/ https://www.rosettainstitute.org/biomedical-summer-camps/applyfinances/ For a list of several Biomedical & Life Sciences opportunities, check this link: https://docs.google.com/document/d/1v9qPOmZ6djyM1jAfwIv-DBIEnR61RB2R/edit."
    },
    {
      "id": 1389,
      "title": "Summerengineeringexperienceprogram",
      "description": "Links: https://www.vaughn.edu/summer-programs/ https://www.vaughn.edu/summer-programs/#see-stem."
    },
    {
      "id": 1369,
      "title": "To learn about several local political camp",
      "description": "aigns seeking high school volunteers, check this link: https://docs.google.com/document/d/1a8qzwZdcOLHjDFvkExwzgbIbLEYe0omd/edit."
    },
    {
      "id": 1346,
      "title": "Https tksworld notion site TKS-Financial-Aid-Program-8df962af96e8424f8f3322c0d",
      "description": "https://tksworld.notion.site/TKS-Financial-Aid-Program-8df962af96e8424f8f3322c0d - High-quality opportunity extracted from Stuyvesant Student Opportunity Bulletin with comprehensive details available."
    },
    {
      "id": 1327,
      "title": "Application Deadline",
      "description": ": May 31 https://www.eventbrite.com/e/brooklyn-community-board-9-youth-job-fair-tickets- 1328595788769?aff=oddtdtcreator."
    },
    {
      "id": 1307,
      "title": "Tuition scholarship",
      "description": "your-one-stop-guide-to-securing-free-money-for-college https://docs.google.com/spreadsheets/d/12UUO-Om8HtAFJ8bE- aQo1ZNBSixsHLinhvCyfn94CbQ/edit?gid=0#gid=0 Reserve Officers Training Corps (ROTC) The various military services offer Reserve Officers Training Corps (ROTC) full- s to graduating seniors."
    },
    {
      "id": 1289,
      "title": "Click on the link below for a list of helpful lists and guides to a wide variety of program",
      "description": "Opportunity Lists and Resources: s and other opportunities: https://docs.google.com/document/d/1507ozc- AbhTI6DlTRBTQWMpRHToNMRki/edit?usp=sharing&ouid=111212941873538043271&rtpof=true&sd=true."
    },
    {
      "id": 1288,
      "title": "Teen artists may enter the Congressional Art Competition",
      "description": ", for a chance to have their artwork on display at the U.S. Capitol for one year. Entries must be submitted through your local congressperson. Contact your representative to confirm your district’s participation and for guidance – consult this link to find your representative: https://www.house.gov/."
    },
    {
      "id": 1269,
      "title": "Write the World Virtual Summer Writing Camp",
      "description": "Application Link: https://www.neighborhoodplayhouse.org/apply s 2025 “Jump into new genres of writing, connect with campers across the globe, and learn from notable authors, editors, and educators in Write the World’s Virtual Writing."
    },
    {
      "id": 1265,
      "title": "Uptown Stories Summer Writing Workshop",
      "description": "Link: https://www.hookarts.org/education-for-teachers s “Come write the world with US! No matter which class you choose, you’ll become a better writer and communicator, and you’ll hold your head a little higher knowing you’re a published author. This is your space, where your voice will be heard, an."
    },
    {
      "id": 1262,
      "title": "LitchfieldJazzCamp",
      "description": "Application Form: https://form.jotform.com//ljc-registration- Filmmaking at Hooks Art Media “Accepted applicants will learn how to use DSLR cameras and the professional sound and lighting equipment used on sets all around the world. Students learn camera operation, sound recording, use of lighting e."
    },
    {
      "id": 1211,
      "title": "Https www eventbrite com e dnalc-nyc-summer-camp-open-house-tickets- 136642187",
      "description": "https://www.eventbrite.com/e/dnalc-nyc-summer-camp-open-house-tickets- 136642187 - High-quality opportunity extracted from Stuyvesant Student Opportunity Bulletin with comprehensive details available."
    },
    {
      "id": 1199,
      "title": "Museum of Mathematics Program",
      "description": "Link: https://momath.org/math-gym/ s & Volunteer Opportunities: Check the link below to access many of MoMath’s programs (some are being offered for free or at a reduced rate for those in need) — please visit individual event pages for more information: https://docs.google.com/document/d/1mL_puq2MlF."
    },
    {
      "id": 1159,
      "title": "General List of Opportunities in NYC Parks",
      "description": ": https://docs.google.com/document/d/1a08Bhj7zi4ZCEIExvhjVjY7Xk7jssfJu/edit General List of Other Park/Nature/Environmental Opportunities https://docs.google.com/document/d/1tEYag-T7u1elStpir1H89c5j04K_fH1M/edit."
    },
    {
      "id": 1158,
      "title": "Guide to Summer Art Program",
      "description": "Application Deadline: Rolling Basis (Applications accepted until program is full) Cost: Free https://airtable.com/appQuqObez96NaMtU/shr3xYXKbVT6V5C08?mc_cid=621e868224&mc_eid= e22eb70ff3 s & Internships Teen Life magazine offers this general guide to art-related summer options for high school studen."
    },
    {
      "id": 1126,
      "title": "MyHistoryMyFuture social media camp",
      "description": "Link: https://www.justiceeducationproject.org/join-national-team https://www.justiceeducationproject.org/ My History My Future “The New York State is highlighting students’ reflections on the impacts of history and its relevance to their generation. This month, we invite students to participate in t."
    },
    {
      "id": 1076,
      "title": "NYC HERricane Summer Session",
      "description": "https://www.nsliforyouth.org/virtual/virtual-nsli-y-application-timeline/ 2025."
    },
    {
      "id": 1068,
      "title": "Cost 3,500 (after automatic 3,500 deduction from full",
      "description": "tuition of $7,000 for admitted students) https://docs.google.com/document/d/1xnEBnsYay1iC2lr1oIIaMVoDQNFf8wXkXoH ArYqXzAg/edit?tab=t.adubulqy1kse."
    },
    {
      "id": 1062,
      "title": "To apply for an internship with the Virginia Maloney for NYC City Council camp",
      "description": "aign, apply online at https://forms.gle/oH2LaXR2SY6GZKcLA."
    },
    {
      "id": 1040,
      "title": "Fafsa_workshop",
      "description": "Links: https://www.suny.edu/attend/events/ https://engage.suny.edu/portal/financial_aid_sessions_virtual https://engage.suny.edu/portal/how_to_apply https://engage.suny.edu/portal/s."
    },
    {
      "id": 1015,
      "title": "Edit For a list of some food program",
      "description": "General List of Local Volunteer Opportunities: https://docs.google.com/document/d/1Ga_zhBHE0mD8pWZUhwTSgRxAm6sKT7Tv/s that help hungry New Yorkers, click this link: https://docs.google.com/document/d/1UY15eiBx6nX561v06oDaCoDW5jzbijVj/edit."
    },
    {
      "id": 1014,
      "title": "List of Volunteer Tutoring Opportunities",
      "description": ": https://docs.google.com/document/d/1gsI8RkusrKOkhUrtPOtmhCU04oRoCQaz/edit."
    },
    {
      "id": 1010,
      "title": "Luna Park Summer Jobs",
      "description": "Application Deadline: Rolling Basis https://docs.google.com/forms/d/e/1FAIpQLSfrGv1mK2aD8FS1q9YmFnu1CW41EC6ggvVI1F1W ktO29iVMYQ/viewform “Luna Park is the largest theme park in NYC, and they offer many exciting opportunities whether you want to work behind the scenes or right in the middle of the."
    },
    {
      "id": 1002,
      "title": "Business_bootcamputm_camp",
      "description": "Application Deadline: Rolling Basis https://www.nyit.edu/management/aign=businessbootca mp&utm_medium=email&utm_source=slate."
    },
    {
      "id": 951,
      "title": "List of Summer Camp",
      "description": "Jobs (Day and Sleep-Away Camps) https://docs.google.com/document/d/1LikBIRivfIHC655DN9wcG4YHVX_s2YrD/edit."
    },
    {
      "id": 947,
      "title": "Summer & Fall Terms",
      "description": "Link: https://docs.google.com/forms/d/e/1FAIpQLSdmzMdtkzMRMOcD1Svv_jgZTAn5mJ- Zq2MSLcUywmtcVdVtcQ/viewform Harvard Student Agencies Weekend Junior Academies/ “The Academies @HOME offers weekend programs curated by Harvard faculty and taught by undergraduates to help students explore a career path of."
    },
    {
      "id": 928,
      "title": "Steminstitute",
      "description": "Link: https://nyc.org/apply-now/ Application Link:."
    },
    {
      "id": 925,
      "title": "SV_cIONplZ0K28C0ke For a list of some other free summer STEP programs at several camp",
      "description": "Application Link: https://nyumc.qualtrics.com/jfe/form/uses around the city, check this link: https://docs.google.com/document/d/1SKPBTE_hNWj1XMbBhT9Vj3lE-SvQRfJm/edit."
    },
    {
      "id": 922,
      "title": "And, in some cases, earn college credits Some",
      "description": "offer financial aid. Here is a list of some to explore: https://docs.google.com/document/d/1mXUhzVmlFGkkApCNwXK7mySfFVFtNEhZ/edit."
    },
    {
      "id": 861,
      "title": "Summitstemfellowship",
      "description": "Link: https://www..org/ https://www.summitstemfellowship.org/faq."
    },
    {
      "id": 855,
      "title": "Application Deadline",
      "description": ": Rolling Basis (Limited Capacity) https://www.lvc.edu/about/camps-community-programming/computer-data-science- summer-camp/."
    },
    {
      "id": 840,
      "title": "Bostonleadershipinstitute",
      "description": "https://www..com/application/ Your Future in STEM Resource “Want to launch a future into STEM? Then subscribe for our newsletter for the latest news and opportunities to boost your future!”."
    },
    {
      "id": 745,
      "title": "Conference Medicine and Research Virtual Summer Program",
      "description": "Application Link: https://survey.alchemer.com/s3/8026141/Student-Research-Internship-2025- Application International Young Researchers’."
    },
    {
      "id": 714,
      "title": "Application Pathways to Stem Cell Science Course",
      "description": "Application Link: https://survey.alchemer.com/s3/8026141/Student-Research-Internship-2025- s in California."
    }
  ],
  "emptyLinks": [],
  "fragmentEntries": [
    {
      "id": 1527,
      "title": "Over the course",
      "description": "in Manhattan & Long Island. of the session, teen interns develop leadership skills and build intergenerational connections through a variety of activities."
    },
    {
      "id": 1481,
      "title": "Event Approaching",
      "description": ": Math Gym at the Museum of Mathematics “Students will spend an hour independently working on engaging and beautiful math problems, hand-selected by MoMath’s advisory council of math PhDs. Choose whichever challenges you like and explore them with the guidance and mentorship of an expert mathematici."
    },
    {
      "id": 1450,
      "title": "Available careers",
      "description": ": Medicine, Engineering, Investment Banking, Law, Psychology, Architecture, Art, Dentistry, Entrepreneurship, Fashion, Filmmaking, Forensic Science, International Development, Journalism, Politics, Software Engineering, Vet, Video Game Design, and Writing."
    },
    {
      "id": 1423,
      "title": "Event Approaching",
      "description": ": NYPL Anti Prom Event “Come hang out and dance the night away at Manhattan Anti-Prom, the Library's annual celebration for teens, featuring music, art activities, snacks, and more. Special outfits are optional… but always encouraged! Anti-Prom welcomes and celebrates young people of all sexualities."
    },
    {
      "id": 1372,
      "title": "Event Approaching",
      "description": ": Metropolitan Museum: Teens Take the Met! “Come and be the first to experience The Met’s new Michael C. Rockefeller Wing, featuring the Museum’s collections of the arts of Africa, the ancient Americas, and Oceania. With performances, music, and more, there's something for everyone to enjoy. No link."
    },
    {
      "id": 1338,
      "title": "Vogue Summer School",
      "description": "“ invites high school students who are curious and passionate about the world of fashion to experience it first-hand in the heart of New York City— one of the most important fashion capitals in the world. Students will explore a range of topics shaping the industry today and can choose from speciali."
    },
    {
      "id": 1271,
      "title": "MetroTech Center",
      "description": "Locations: NYU (6 , Brooklyn, NY ) or Barnard College (3009 Broadway, Manhattan) Cost: Free."
    },
    {
      "id": 1242,
      "title": "Through this course",
      "description": "Polyphony Lit or their high school literary magazine. , students will connect with a global community of peer writers and readers. We believe that editing offers students an opportunity to develop and celebrate their unique voices in a way that is both fun and rewarding!”."
    },
    {
      "id": 1220,
      "title": "City Center",
      "description": "and complimentary tickets to a production. Upon completion of each session, participants will leave with their creative project materials.”."
    },
    {
      "id": 1208,
      "title": "DNA Learning Center",
      "description": "Event Approaching: In-Person & Virtual Summer Day Camps Open House."
    },
    {
      "id": 1187,
      "title": "Week course",
      "description": ", at the end of which you will have gained knowledge that can help you in everyday life and for future job opportunities.”."
    },
    {
      "id": 1165,
      "title": "Silent Spring is",
      "description": "“This summer, offering a free virtual program for high school students interested in learning about environmental health. Students will learn how our everyday environments—the water we drink, the air we breathe, the food we eat, and the products we use—shape our health and well-being and how science."
    },
    {
      "id": 1022,
      "title": "Family Fridays",
      "description": ": “Up To One Million Dollars In Prize Money May Be Given Away!” with Chaim Goodman-Strauss Seeking volunteers to help with event setup, check-in, assisting the speaker and engaging with the families throughout the event, and the all-important breakdown and cleanup at the end of the event. - Sunday, ."
    },
    {
      "id": 959,
      "title": "Our Summer Youth",
      "description": "“ Tillers program aims to encourage intergenerational learning spaces through youth providing hands on support to community gardeners during the busiest time of the growing season. You will learn about the history behind community gardening, the people power behind green spaces and the value of such."
    },
    {
      "id": 930,
      "title": "Each course",
      "description": "teachers. consists of 6 one-hour-long classes held weekly via Zoom.” The classes offered are APUSH, AP African American Studies, and AP US Government and Politics."
    },
    {
      "id": 916,
      "title": "Examples of Course",
      "description": "s Offered: Introduction to Sociology, General Psychology, Principles in Information Technology & Computation."
    },
    {
      "id": 899,
      "title": "Harvey Blumm at",
      "description": ": hblumm@stuy.edu - we will share your helpful information with the Stuy community!"
    },
    {
      "id": 536,
      "title": "Hispanic Scholar",
      "description": "Hispanic Scholar - A scholarship opportunity for high school students. Research this scholarship online for official application details, requirements, and deadlines. Verify eligibility criteria and application procedures on the official website."
    },
    {
      "id": 477,
      "title": "LULAC Honors Award",
      "description": "LULAC Honors Award - A scholarship opportunity for high school students. Research this scholarship online for official application details, requirements, and deadlines. Verify eligibility criteria and application procedures on the official website."
    },
    {
      "id": 402,
      "title": "One Refugee Scholar",
      "description": "One Refugee Scholar - A scholarship opportunity for high school students. Research this scholarship online for official application details, requirements, and deadlines. Verify eligibility criteria and application procedures on the official website."
    },
    {
      "id": 345,
      "title": "TASS Summer Seminar",
      "description": "Humanities seminars on race and social justice"
    },
    {
      "id": 336,
      "title": "PROMYS (Boston U)",
      "description": "6-week intensive math research program"
    },
    {
      "id": 309,
      "title": "George Mason ASSIP",
      "description": "STEM research with faculty mentorship"
    },
    {
      "id": 304,
      "title": "Diamond Challenge",
      "description": "Global entrepreneurship competition for high school students to pitch business or social venture ideas (in Business or Social tracks) for a $100,000 prize pool. Teams submit a business concept and pitch to judges."
    },
    {
      "id": 303,
      "title": "Technovation Girls",
      "description": "Global technology entrepreneurship competition where teams of girls (ages 10–18) develop a mobile app or AI project to solve a community problem. Winners can earn scholarships and a trip to the World Summit."
    },
    {
      "id": 301,
      "title": "Conrad Challenge",
      "description": "International entrepreneurship competition for teams of 2–5 students to develop innovative solutions in categories like Aerospace, Energy, Health, etc. Finalists pitch at the Innovation Summit and compete for scholarships and prizes."
    },
    {
      "id": 234,
      "title": "Google Code Jam",
      "description": "Global coding competition where programmers of all levels solve algorithmic puzzles to earn a spot at World Finals. Winner receives $15k."
    },
    {
      "id": 205,
      "title": "CalTech Up Close",
      "description": "FGLI, minority, and STEM student fly-in program. Decisions released in September."
    },
    {
      "id": 144,
      "title": "TeenLife Blog",
      "description": "Articles and guides about summer programs and other opportunities for high school students across various interests."
    },
    {
      "id": 143,
      "title": "Travel for Teens",
      "description": "Offers teen travel programs focused on cultural immersion, service, language learning, and adventure."
    },
    {
      "id": 142,
      "title": "Pathway to Science",
      "description": "A curated database of research and enrichment programs for high school students interested in STEM fields."
    },
    {
      "id": 135,
      "title": "Travel Abroad",
      "description": "International immersion programs combining language learning, cultural exchange, and service projects. 2025 trips available across multiple destinations."
    }
  ],
  "duplicates": [],
  "toDelete": [
    1527,
    1523,
    1518,
    1514,
    1511,
    1510,
    1508,
    1507,
    1505,
    1500,
    1494,
    1493,
    1492,
    1491,
    1490,
    1489,
    1485,
    1481,
    1479,
    1474,
    1472,
    1471,
    1465,
    1462,
    1460,
    1459,
    1457,
    1454,
    1452,
    1450,
    1449,
    1438,
    1433,
    1430,
    1425,
    1423,
    1422,
    1421,
    1414,
    1413,
    1407,
    1406,
    1400,
    1395,
    1394,
    1389,
    1387,
    1384,
    1380,
    1374,
    1373,
    1372,
    1369,
    1368,
    1354,
    1351,
    1348,
    1347,
    1346,
    1345,
    1338,
    1336,
    1327,
    1321,
    1318,
    1316,
    1314,
    1311,
    1310,
    1308,
    1307,
    1299,
    1289,
    1288,
    1287,
    1285,
    1284,
    1281,
    1278,
    1275,
    1271,
    1269,
    1265,
    1262,
    1256,
    1255,
    1254,
    1242,
    1238,
    1233,
    1230,
    1229,
    1223,
    1221,
    1220,
    1218,
    1217,
    1216,
    1214,
    1211,
    1208,
    1202,
    1199,
    1198,
    1194,
    1192,
    1187,
    1185,
    1179,
    1174,
    1166,
    1165,
    1159,
    1158,
    1157,
    1150,
    1144,
    1141,
    1139,
    1138,
    1137,
    1135,
    1130,
    1127,
    1126,
    1123,
    1121,
    1110,
    1105,
    1100,
    1098,
    1093,
    1092,
    1076,
    1068,
    1062,
    1040,
    1035,
    1031,
    1029,
    1022,
    1021,
    1015,
    1014,
    1013,
    1010,
    1005,
    1002,
    989,
    978,
    972,
    968,
    966,
    963,
    959,
    955,
    951,
    947,
    942,
    939,
    936,
    934,
    933,
    930,
    928,
    925,
    923,
    922,
    919,
    918,
    916,
    899,
    897,
    895,
    894,
    893,
    892,
    891,
    890,
    887,
    886,
    885,
    883,
    880,
    875,
    874,
    865,
    863,
    861,
    855,
    840,
    835,
    834,
    830,
    828,
    814,
    813,
    810,
    807,
    805,
    803,
    802,
    801,
    800,
    795,
    793,
    788,
    786,
    785,
    782,
    767,
    765,
    750,
    748,
    745,
    730,
    724,
    716,
    714,
    710,
    697,
    696,
    623,
    618,
    615,
    603,
    600,
    574,
    536,
    516,
    477,
    454,
    453,
    404,
    402,
    377,
    345,
    336,
    309,
    304,
    303,
    301,
    234,
    205,
    144,
    143,
    142,
    138,
    135
  ]
}