[
  {
    "title": "Summer Health Professions Education Program (SHPEP) - Columbia University",
    "description": "Focus on improving access to information and resoruces for college students interested in health professions",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20Health%20Professions%20Education%20Program%20(SHPEP)%20-%20Columbia%20University%20application",
    "deadline": "February 5, 2021",
    "eligibility": "Both State Residents AND US Citizens/Permanent Residents ",
    "cost": "Free",
    "stipend": "$600",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer Health Professions Education Program (Howard)",
    "description": "The Summer Health Professions Education Program (SHPEP) at Howard University provides an outstanding academically enriched program that contributes to a culture of health and promotes diversity in health care. The program is designed to strengthen the academic proficiency and overall professional school readiness of talented students from groups that are disadvantaged and traditionally underrepresented in the health care professions.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20Health%20Professions%20Education%20Program%20(Howard)%20application",
    "deadline": "February 5, 2021",
    "eligibility": "US Citizens/Permanent Residents Only",
    "cost": "Free",
    "stipend": "$600",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer Health Professions Education Program (Louisville)",
    "description": "The Summer Health Professions Education Program (SHPEP) at the University of Louisville, introduces prospective medical, dental, nursing, and pharmacy scholars to the academic rigors of health professions education. Scholars will use team-based learning to integrate and apply the basic and social sciences centered on two major themes: Diabetes and Cardiovascular Disease. Scholars will work in inter-professional collaborative teams to develop and implement treatment plans with dental/medical/nursing/pharmacy applications",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20Health%20Professions%20Education%20Program%20(Louisville)%20application",
    "deadline": "February 5, 2021",
    "eligibility": "Both State Residents AND US Citizens/Permanent Residents ",
    "cost": "Free",
    "stipend": "Not specified",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer Health Professions Education Program (Nebraska)",
    "description": "SHPEP at the University of Nebraska Medical Center (UNMC) provides scholars with an interest in Medicine, Dentistry, Nursing, Public Health, and Physical Therapywith academic enrichment in the basic sciences and math, clinical experiences, career development activities, learning and study skills seminars, and a financial planning workshop. SHPEP pays for all travel, housing, meals, and provides a stipend! ",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20Health%20Professions%20Education%20Program%20(Nebraska)%20application",
    "deadline": "February 5, 2021",
    "eligibility": "US Citizens/Permanent Residents Only ",
    "cost": "Free",
    "stipend": "Yes",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer Health Professions Education Program (Rutgers)",
    "description": "The program will strengthen students’ skills by providing the science course work, critical thinking, problem solving, and communication skills necessary to ensure that they are competitive for medical/dental school.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20Health%20Professions%20Education%20Program%20(Rutgers)%20application",
    "deadline": "February 5, 2021",
    "eligibility": "Both State Residents AND US Citizens/Permanent Residents ",
    "cost": "Free",
    "stipend": "yes",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer Health Professions Education Program (UCLA & Drew)",
    "description": "The UCLA/CDU SHPEP mission is to serve as a model learning community in which students examine a variety of healthcare issues affecting medically underserved communities through problem-based learning cases, lectures, clinical experiences, small-group discussions, and a research project. ",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20Health%20Professions%20Education%20Program%20(UCLA%20%26%20Drew)%20application",
    "deadline": "February 5, 2021",
    "eligibility": "Summer Health Professions Education Program (UCLA & Drew)",
    "cost": "Free",
    "stipend": "yes",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer Health Professions Education Program (UT Houston)",
    "description": "SHPEP’s goal is to strengthen the academic proficiency and career development of students underrepresented in the health professions and prepare them for a successful application and matriculation to health professions schools.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20Health%20Professions%20Education%20Program%20(UT%20Houston)%20application",
    "deadline": "February 5, 2021",
    "eligibility": "Both State Residents AND US Citizens/Permanent Residents ",
    "cost": "Free",
    "stipend": "yes",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer Health Professions Education Program (Washington)",
    "description": "The UW SHPEP will emphasize a culture of health by encouraging scholars to consider from the cellular to the global level factors that influence health. In addition, scholars will be encouraged to explore what their unique role will be in improving the health of communities with curricula exploring self-identity, culture and personal strengths in a context presenting a range of health professions. Rigorous academic course work will include population health, basic sciences, and biostatistics and will utilize lectures, active learning, discussions, peer mentoring and self-reflection. Experiential activities will include clinical and public health shadowing, simulation exercises, and community needs assessments.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20Health%20Professions%20Education%20Program%20(Washington)%20application",
    "deadline": "February 5, 2021",
    "eligibility": "Both State Residents AND US Citizens/Permanent Residents",
    "cost": "No",
    "stipend": "$600",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer Health Professions Education Program (Western)",
    "description": "Western University of Health Sciences in one of thirteen national SHPEP program sites. WesternU offers this summer enrichment program for college freshmen and sophomores who are interested in health professions such as medicine, dentistry, physical therapy, optometry, podiatry, pharmacy, nursing and physician assistant",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20Health%20Professions%20Education%20Program%20(Western)%20application",
    "deadline": "February 5, 2021",
    "eligibility": "US Citizens/Permanent Residents Only",
    "cost": "No ",
    "stipend": "$600",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "MD-PhD Undergraduate Summer (MPUS) Fellowship",
    "description": "During this 10 week fellowship running from mid June until mid August, Fellows will be exposed to basic medical science research by conducting cutting edge research alongside one of our MD-PhD students presently in the PhD portion of their training. In addition, Fellows will have the opportunity to examine the clinical aspect of medicine during weekly rounds with one of Dartmouth's illustrious clinical faculty at the Dartmouth Hitchcock Medical Center (DHMC). Finally, Fellows will be exposed to the wonderful community of MD-PhD students at Dartmouth and get to better understand the role of, and opportunities available to, the physician-scientist in training. ",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=MD-PhD%20Undergraduate%20Summer%20(MPUS)%20Fellowship%20application",
    "deadline": "N/A",
    "eligibility": "Applicant must be a sophomore or junior at time of application. Applicant must hold either US citizenship or permanent resident status.",
    "cost": "Free",
    "stipend": "$1,000",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Undergraduate Research for Prospective Physician-Scientists and Physician-Engineers",
    "description": "The Undergraduate Research for Prospective Physician-Scientists and Physician-Engineers Program, IU School of Medicine’s summer research program for future physician scientists, is designed for high-performing undergraduate students who are committed to pursuing an integrated clinical and research career and plan to pursue combined-degree training in an MD/PhD Program.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Undergraduate%20Research%20for%20Prospective%20Physician-Scientists%20and%20Physician-Engineers%20application",
    "deadline": "February 5, 2021",
    "eligibility": " Applicants must be a citizen of the United States or a permanent resident of the United States ",
    "cost": "Free",
    "stipend": "$2,600.00",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "SUCCESS Summer Undergraduate Course Creating Excellence in Scientific Study",
    "description": "Offer three core programs – in biomedical sciences, neuroscience and biomedical engineering – and many affiliate PhD programs. Additionally, an MSTP Fellowship for pediatric research is available through a special partnership with Nationwide Children’s Hospital. Ohio State’s LSI3 curriculum blends our innovative medical school program with the curricula of partnering graduate programs to provide MSTP students with a comprehensive learning experience.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=SUCCESS%20Summer%20Undergraduate%20Course%20Creating%20Excellence%20in%20Scientific%20Study%20application",
    "deadline": "Open June 1, Close Nov 1",
    "eligibility": "Students who have completed their second year of medical school are eligible to apply to the MSTP as Advanced Training Applicant (ATAs). These students are evaluated as rigorously as new applicants (including the requirement for high-level research experience) and are accepted into the program only if their achievements are equivalent to the excellence of our other MSTP students.",
    "cost": "Contact program",
    "stipend": "Yes",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer in Biological Sciences (SIBS) Undergraduate Research Program",
    "description": "The Summer in Biomedical Science (SIBS) Undergraduate Research Program will provide the opportunity for young people to be instructed in the techniques of modern biology while becoming integrated members of a vibrant clinical and scientific community.  ",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20in%20Biological%20Sciences%20(SIBS)%20Undergraduate%20Research%20Program%20application",
    "deadline": "February 12, 2021",
    "eligibility": "summer program students must be U.S. citizens or permanent residents.",
    "cost": "Free",
    "stipend": "SIBS participants will receive a stipend of $2,500 for their participation in the program",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Preparation for Graduate and Medical Education (PARAdiGM) Program",
    "description": "PARAdiGM is UAB's NIH/NHLBI R25 funded summer program for outstanding undergraduates from disadvantaged and underrepresented minority backgrounds who want to explore the potential of a future career as a physician-scientist - becoming a scientific investigator and a practicing physician.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Preparation%20for%20Graduate%20and%20Medical%20Education%20(PARAdiGM)%20Program%20application",
    "deadline": "February 12, 2021",
    "eligibility": "?",
    "cost": "Contact program",
    "stipend": "PARAdiGM students will receive a stipend of $3,200 for their participation in the program.",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer Undergraduate Research Fellowship (SURF) Program",
    "description": "A program designed for motivated undergraduate students who are interested in learning about a career as a Physician-Scientist (M.D./Ph.D.). ",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20Undergraduate%20Research%20Fellowship%20(SURF)%20Program%20application",
    "deadline": "January 31, 2021",
    "eligibility": "Students appointed to this program must be citizens or non-citizen nationals of the United States or must have been lawfully admitted for permanent residence ",
    "cost": "Free",
    "stipend": "Stipend for the eight-week period - $1600/month",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer Undergraduate MSTP Research (SUMR) Program",
    "description": " Our training mission is to foster the development of inquisitive, creative, and rigorous scientists who will be future leaders in the advancement of the science of medicine and its translation into clinical practice.  To do this, we have developed an integrated training program to ensure that MSTP students are engaged in activities that build knowledge and skills in both science and medicine in a nurturing academic environment.  These opportunities capitalize on the vibrant community of University of Iowa scholars.  For more information or application advising, please contact the MSTP leadership.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20Undergraduate%20MSTP%20Research%20(SUMR)%20Program%20application",
    "deadline": "February 5, 2021",
    "eligibility": "Citizen or permanent resident of the United States\r\nBe a rising junior or senior (your earliest anticipated graduation should not be before December 2018)\r\nMajor in biological or physical science\r\nPrior research experience required\"",
    "cost": "Free",
    "stipend": "$4,150",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "MD/PhD Summer Undergraduate Research Program",
    "description": "This is a great opportunity for students to discover first-hand the broad spectrum of research activities being performed at the University of Nebraska Medical Center. A wide variety of exciting research projects are available, from studies at the molecular level to patient oriented clinical research and healthcare outcomes research. Not only will students do research, but successful applicants will also have the opportunity to shadow physicians. This gives students a chance to experience great science as well as the doctor/patient relationship side of medicine. We can provide a summer of challenges and exceptional learning experiences.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=MD%2FPhD%20Summer%20Undergraduate%20Research%20Program%20application",
    "deadline": "February 1, 2021",
    "eligibility": "Although we are especially interested in undergraduate students who are currently in their sophomore year of college, current freshman and juniors are also encouraged to apply. ",
    "cost": "Free",
    "stipend": "$3,600.00",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Gateways to the Laboratory Summer Program",
    "description": "In 1993, the Weill Cornell/Rockefeller/Sloan Kettering Tri-Institutional MD-PhD Program became the first MD-PhD Program in the country to establish a summer program for underrepresented minority and disadvantaged college students who wish to pursue the combined MD-PhD degree.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Gateways%20to%20the%20Laboratory%20Summer%20Program%20application",
    "deadline": "January 31, 2021",
    "eligibility": "Must be a Pre-MD-PhD student.\nMust be a college freshman or sophomore.\nMust be a US citizen or permanent resident.\nMust have a physical or mental impairment that substantially limits one or more major life activities or must be a member of an underrepresented minority group or otherwise disadvantaged group, as described by the National Institutes of Health. ",
    "cost": "Free",
    "stipend": "$6,000",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer Student Training and Research (STAR)",
    "description": "This program provides opportunities for highly motivated and talented undergraduate students to develop skills as young scientists and to further explore their interest in biomedical research.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20Student%20Training%20and%20Research%20(STAR)%20application",
    "deadline": "Check back in Jan 2021 for updates",
    "eligibility": "18 years or older by start of the STAR session\nCompletion of at least freshman year in college\nMinimum overall GPA of 3.0\nMinimum GPA of 3.0 in science courses\nCurrently enrolled in an undergraduate degree program*\nProof of current Health Insurance Coverage that extends throughout the duration of the Summer STAR Program\nUnited States Citizenship (or hold permanent resident status) or international students currently enrolled in US college/university holding a student non-immigrant visa**\nProof of current social security number/card for employment purposes, with original card for documentation ",
    "cost": "Free",
    "stipend": "$4,500",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer Medical and Research Training Program (SMART)",
    "description": "The Summer Undergraduate Research Training (SMART) Program was developed to provide frontier-level, biomedical summer research projects for undergraduates in a supportive environment with supplemental educational activities.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20Medical%20and%20Research%20Training%20Program%20(SMART)%20application",
    "deadline": "1/10/2021",
    "eligibility": "All applicants must currently be attending a university in the United States and returning to the college/university to complete their undergraduate degree. Applicants must have a minimum GPA of 3.0",
    "cost": "Free",
    "stipend": "$5,000",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer Training as Research Scholars (STaRS)",
    "description": "STaRS is a dynamic and focused program that is designed to promote access to graduate education for traditionally underrepresented students in science and medicine. STaRS provides scholars with the opportunity to participate in research and enhances skills required for successful entrance and completion of a graduate program or an MD/PhD program in the biomedical sciences.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20Training%20as%20Research%20Scholars%20(STaRS)%20application",
    "deadline": "February 1, 2020",
    "eligibility": "Be a U.S. citizen or permanent resident.\r\nBe a rising junior or rising senior at the start of Summer 2019 and currently enrolled in a degree program, part-time or full-time, leading to a Bachelor’s degree.\r\n(*If you are graduating in 2019, please see below.)\r\nHave a cumulative GPA of at least 3.0 on a 4.0 scale.\r\nHave an interest in biological research\r\nHave some prior research experience",
    "cost": "Free",
    "stipend": "$4,800",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "BioMed Summer Undergraduate research Fellowship (SURF)",
    "description": "BioMed SURF is a research-intensive summer training program in biomedical research for undergraduate students who plan to obtain a Ph.D. or M.D./Ph.D. in the biomedical sciences. We particularly encourage students who are members of groups underrepresented in the sciences, who are the first in their families to college, who are from inner city or rural communities, or who have grown up with financial or other disadvantage to apply.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=BioMed%20Summer%20Undergraduate%20research%20Fellowship%20(SURF)%20application",
    "deadline": "Updates coming in December",
    "eligibility": "Are United States citizens or permanent residents who are members of an underrepresented minority in the sciences as defined by the National Institutes of Health (NIH); disadvantaged students will also be considered\nAre freshman or sophomores in excellent academic standing at a college, university or junior college\nHave completed at least one semester of college-level biology, chemistry or physics at the time of application",
    "cost": "Free",
    "stipend": "$4,500",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Harvard Summer Research Program in Kidney Medicine",
    "description": "The Harvard Summer Research Program in Kidney Medicine (HSRPKM) offers a robust and varied introduction to the world of nephrology for the undergraduate college student who is considering a career in science or medicine. The Program is primarily a research-based experience but includes a core curriculum that addresses the basic science and clinical fundamentals and challenges in the field. The Program spans the nephrology divisions of four Harvard-affiliated hospitals – Brigham and Women’s Hospital (BWH), Beth Israel Deaconess Medical Center (BIDMC), Boston’s Children’s Hospital (BCH) and Massachusetts General Hospital (MGH). The Program runs for approximately 8 weeks each summer.\r\n\r\n",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Harvard%20Summer%20Research%20Program%20in%20Kidney%20Medicine%20application",
    "deadline": "Application for 2021 not yet open",
    "eligibility": "GPA 3.4 or higher Currently enrolled in undergraduate degree seeking program Must be a US citizen or Permanent Resident (Green Card holder) Must be committed to entire 8+ week program (approximately June 1- August 1) Research experience preferred, but not required NOTE: Each finalist will have a brief phone interview.\n\n\n\n\n",
    "cost": "Free",
    "stipend": "$1,000",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer Undergraduate Research in Pharmacology",
    "description": "For more than 35 years, the Department of Pharmacology has sponsored a summer research program designed to introduce college undergraduates to basic laboratory research. This 10-week program has been partially sponsored by American Society for Pharmacology and Experimental Therapeutics (ASPET, https://www.aspet.org/awards/surf/). Students  (5-7 total) are recruited from a national applicant pool (~400 individuals per year), with some emphasis on the numerous, small, and high-quality academically oriented undergraduate institutions in United States. The program supplies a stipend and contributes additional funds to defray housing and travel expenses. Overall goal of the program is to provide students with background and skills essential for a career in pharmacological or basic science research. In addition, our program aims to establish an understanding of the commitment essential to successfully pursue a career in biomedical science.\r\n\r\n",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20Undergraduate%20Research%20in%20Pharmacology%20application",
    "deadline": "January 31, 2021",
    "eligibility": "Successful applicants should have strong academic records and have completed at least one laboratory course prior to application. Previous experience performing independent laboratory research is not required. Those students entering their junior or senior year are given preference.",
    "cost": "Free",
    "stipend": "$3,000",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Undergraduate Summer Student Program",
    "description": "The Summer Undergraduate Research Fellowship (SURF) Program at Cincinnati Children’s Hospital Medical Center offers undergraduates the chance to explore clinical, translational, and basic science research in laboratories in the Department of Pediatrics, University of Cincinnati College of Medicine. The primary goal is to provide students with a foundation for making career choices in the biomedical sciences. Students have the opportunity to work with one of more than 700 faculty members at Cincinnati Children’s Hospital Medical Center, many of whom have active research programs that cover all areas of pediatric medicine, including the study of developmental biology, congenital disorders, genetic diseases, cancer, cardiology, neurology and immunology.\r\n\r\n",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Undergraduate%20Summer%20Student%20Program%20application",
    "deadline": "February 1, 2021",
    "eligibility": "Students who will be undergraduate freshman, sophomores, juniors or seniors in the Fall of 2019 (with a 3.0 or better GPA) are eligible to apply to the SURF Program. Applicants must be US citizens or permanent residents and have an interest in a career in biomedical research or medicine. Criteria for selection include academic record, answers to essay questions and interest in obtaining research experience.",
    "cost": "Free",
    "stipend": "$4,000",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Travelers Summer Research Fellowship Program",
    "description": "The Travelers Summer Research Fellowship Program is designed to give 25 premedical students deeper insights into the field of medicine, including issues that greatly affect the health of traditionally underserved groups. Through the experiences of laboratory or clinical research, the student learns how one pursues a specific research problem under the supervision of a faculty member, thus providing an early education into basic research techniques that could be applicable to any area of medicine. A lecture series explores topics in cardiovascular physiology, exposing the students to basic science concepts that are relevant to a more specific understanding of hypertension and cardiovascular disease, both of which are major problems in minority communities. ",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Travelers%20Summer%20Research%20Fellowship%20Program%20application",
    "deadline": "February 1, 2021",
    "eligibility": "must be at least in their junior year of college\nmust be declared premed students who have completed two semesters of biology, general chemistry, organic chemistry, and one semester of physics. Preference is given to students with a grade point average of B or above\nmust have a demonstrated commitment to working on issues with underserved populations within the USA\nmust be from one or more of the following groups that are underrepresented in medicine\nIndividuals from racial and ethnic groups shown to be underrepresented in biomedical research: Blacks or African Americans, Hispanics or Latinos, American Indians or Alaska Natives, Native Hawaiians and other Pacific Islanders\nIndividuals from socioeconomically disadvantaged backgrounds\nIndividuals with disabilities (those with a physical or mental impairment that substantially limits one or more major life activities)\nmust be a U.S. Citizen or permanent resident ",
    "cost": "Free",
    "stipend": "$140.00 a week",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Eugene and Ruth Roberts Summer Student Academy",
    "description": "Summer Academy students design and work on their own research projects in areas of their specific interests. City of Hope faculty members act as mentors providing valuable guidance and support, while also encouraging independent thought and exploration. Summer students work closely with post-doctorates, graduate students, and lab personnel of the Irell & Manella Graduate School of Biological Sciences. \r\n \r\nParticipants also communicate their research findings to their peers and instructors in a weekly student seminar series. We also mentor scientific writing by having students produce a written report at the end of their project. An important objective of the program is to develop vital oral and written communication skills, which are so important in the world of seminars, colloquia, manuscript publication and grant writing, a world that is central to graduate student and postgraduate life.\r\n ",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Eugene%20and%20Ruth%20Roberts%20Summer%20Student%20Academy%20application",
    "deadline": "Application not open yet",
    "eligibility": "Applicants must be at least 16 years old before their internship begins\r\nApplicants must be high school or undergraduate students\r\nApplicants must be US citizens or permanent residents\r\nApplicants must complete the online application by March 8, 2019\r\nMost students submit additional materials, such as transcripts, letters of recommendation, and resumes, but these are not required",
    "cost": "Free",
    "stipend": "$4,000",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer Research Opportunities Program",
    "description": "The Summer Research Opportunities Program (SROP) is a gateway to graduate education at Big Ten Academic Alliance universities. The goal of the program is to increase the number of underrepresented students who pursue graduate study and research careers. SROP helps prepare undergraduates for graduate study through intensive research experiences with faculty mentors and enrichment activities.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20Research%20Opportunities%20Program%20application",
    "deadline": "February 10, 2021",
    "eligibility": "Have a cumulative GPA of 3.0 or higher (4.0 scale) Be a citizen or a permanent resident of the U.S. Be enrolled in a degree-granting program at a college or university in the United States, Puerto Rico, or other U.S. territory. Have completed at least two semesters of undergraduate education by the time of the summer experience. Have at least one semester of undergraduate education remaining after completing the summer research experience. Have a strong interest in pursuing a Ph.D.",
    "cost": "Free",
    "stipend": "$3000-$6000",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Undergraduate Biomedical Research Training Program",
    "description": "The HS-MACA/CPHHE Undergraduate Biomedical Research Program enhances college science education and increases the number of underrepresented minority students who are interested and qualified to pursue careers in the biomedical sciences through conducting kinesthetic laboratory research in various biomedical fields.  Students are paired with Creighton University faculty and researchers to conduct ongoing research under the supervision of a faculty mentor.\r\n\r\n",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Undergraduate%20Biomedical%20Research%20Training%20Program%20application",
    "deadline": "Application dates for 2021 TBA",
    "eligibility": "A student must have a 3.0 or better grade average\r\nSophomore, Junior, Senior college academic standing at time of application\r\n Copy of college academic transcripts (unofficial or official)\r\nTwo Letters of Recommendation\r\nLiving arrangement within the Omaha area for program duration - no accommodations are provided.",
    "cost": "Free",
    "stipend": "$1,750",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Biomedical Graduate Studies-Summer Undergraduate Research Fellowship",
    "description": "The Graduate School of Biomedical Sciences and Professional Studies offers challenging summer programs for qualified undergraduates: Cross-disciplinary, Innovation-driven, Renowned faculty, Close mentoring. The Graduate School of Biomedical Sciences and Professional Studies awards 10-week Summer Undergraduate Research Fellowships (SURF) to undergraduate students wishing to explore biomedical research careers. Enhance your analytical and technical scientific research skills while working with and receiving mentoring from College of Medicine faculty in various disciplines: Biochemistry, Molecular and cell biology and genetics, Neuroscience, Microbiology and immunology, Pharmacology and physiology",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Biomedical%20Graduate%20Studies-Summer%20Undergraduate%20Research%20Fellowship%20application",
    "deadline": "Application dates for 2021 TBA",
    "eligibility": "Applicants must have an interest in pursuing biomedical research (i.e., PhD or MD/PhD) in graduate school and must be in good standing at their respective undergraduate institutions.\r\nSophomores and juniors (as of spring 2018) are given priority, although freshmen may apply.\r\nSeniors expected to graduate in 2018 are not eligible.\r\nSelection will be based on the student's academic undergraduate record, research experience, letters of recommendation, and statements of research interests and career goals.",
    "cost": "Free",
    "stipend": "$3,000",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "B&B Summer Scholars Program",
    "description": "The B&B Summer Scholars Program provides summer fellowships to selected GSU undergraduates to support their research efforts in faculty laboratories. Call for B&B Scholars goes out to the B&B List Serv April of every year. The Scholars program is happy to announce its partnership with the Initiative for Maximizing Student Development (IMSD) for professional development and poster sessions.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=B%26B%20Summer%20Scholars%20Program%20application",
    "deadline": "Application dates for 2021 TBA",
    "eligibility": "Have a 3.0 GPA or better.\r\nBe current GSU undergraduates in good standing.\r\nCan not be graduating before the program begins.\r\nBe already engaged in research with a B&B faculty member.\r\nHave a B&B faculty nomination.\r\nB&B Scholars will engage in weekly professional development workshops.",
    "cost": "Free",
    "stipend": "approximately ~$1250 over 12 weeks",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer Honors Undergraduate Research Program (SHURP)",
    "description": "SHURP is a ten-week summer research program primarily for college students belonging to groups that are under-represented in the sciences. SHURP presently has 475 alumni from colleges across the country, and over 90% are continuing or planning to continue training and careers in the sciences. SHURP is one of the summer research programs participating in the Summer Research Early Identification Program of the Leadership Alliance, a consortium of 35 colleges and universities dedicated to improving the participation of historically underrepresented students in graduate programs.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20Honors%20Undergraduate%20Research%20Program%20(SHURP)%0A%0A%20application",
    "deadline": "2/1/2020. Application dates for 2021 TBA",
    "eligibility": "To be eligible for SHURP, applicants must be currently-enrolled undergraduates who:\n\nwill not have completed their BA/BS degree by June 2018,\nare considering careers in biological or biomedical research sciences,\nhave already had at least one summer (or equivalent term-time) of experience in a research laboratory,\nhave taken at least one upper-level biology course that includes molecular biology, and\nare U.S. citizens or permanent residents (due to requirements of our federal funding).",
    "cost": "Free",
    "stipend": "$450/week for 10 weeks",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Feinstein Institute for Medical Research Student Intern Program",
    "description": "The Feinstein Institute Summer Student Intern program is a competitive mentored program designed to provide high school, college and graduate students with hands-on experience in disease-oriented research and familiarize them with opportunities that exist for careers in medical research. At the end of the internship, students will be expected to present an academic poster summarizing their research to faculty and other students. This program requires a full 8-week commitment. Students need to be at least 16 years of age before July 1st, 2018.\r\n\r\n",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Feinstein%20Institute%20for%20Medical%20Research%20Student%20Intern%20Program%20%20application",
    "deadline": "2021 Application will become available December 2020",
    "eligibility": "This program requires a full 8-week commitment. Students need to be at least 16 years of age before July 1st, 2018 in order to apply. Students need to be at least 18 years of age before July 1st, 2018 in order to work in the Center for Comparative Physiology. Daily transportation and on-campus housing is not available. All students must have their own transportation and housing arrangements. If selected to participate in the program, students must complete the following: • Visiting Scholar Agreement • Medical Clearance from Northwell Employee Health Services • Background Investigation • Confidentiality Agreement",
    "cost": "Free",
    "stipend": "Not specified",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer Internship Program (SIP)",
    "description": "The Summer Internship Program (SIP) provides experience in research laboratories to students of diverse backgrounds, including underrepresented minority students, students from economically disadvantaged and underserved backgrounds and students with disabilities that have completed one - two or more years of college. The purpose of this exposure to biomedical and/or public health research is to encourage students to consider careers in science, medicine and public health. The program runs ten weeks and a minimum stipend of $3,000 is provided. Housing is provided near our undergraduate campus; the University has a shuttle service that provides convenient transportation between the Johns Hopkins Medicine Institutions (JHMI) and the undergraduate campus.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20Internship%20Program%20(SIP)%20application",
    "deadline": "February 1, 2021",
    "eligibility": "Students must have completed one year of college (i.e., freshman) and be a U.S. citizen or Permanent Resident to apply to the Institute of NanoBioTechnology, Pulmonary Medicine or Summer Institute for Genomics and Society divisions; students must have completed two years of college (i.e., sophomore) and be either a U.S. citizen, Permanent Resident or international student currently studying in the U.S. to apply to the Basic Science Institute division; students much have completed two years of college (i.e., sophomore) and be a U.S. citizen to apply to the Bloomberg School of Public Health, Institute for Cell Engineering (FARMS), Institute for Computational Medicine and the Rosetta Commons Research Experience for Undergraduates divisions of the program. Basic Science Institute students must have a demonstrated interest and potential to pursue a PhD degree.",
    "cost": "Free",
    "stipend": "$3,000",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer Undergraduate Research Experience (SURE) Program",
    "description": "The SURE program for undergraduate research in biotechnology and bioengineering at Keck Graduate Institute (KGI) provides undergraduate students the opportunity for cutting-edge, interdisciplinary research in the areas of applied molecular and cellular biology, bioengineering, computational biology, as well as exposure to related ethics and business topics.\r\n\r\nThe program is appropriate for motivated undergraduate students majoring in biology, chemistry, engineering, or related disciplines. One of the program goals is to promote the success of women and underrepresented minorities in science and engineering.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20Undergraduate%20Research%20Experience%20(SURE)%20Program%20application",
    "deadline": "March 1, 2021",
    "eligibility": "An online application form is required that contains questions about your personal and educational background. Additional requirements (below) can be submitted along with your online application or separately:",
    "cost": "Free",
    "stipend": "$500",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer Undergraduate Pharmacology Experience in Research Program (SUPER)",
    "description": "The SUPER Program is funded by the ASPET/SURF, LSU Health Sciences Foundation and the Department of Pharmacology, Toxicology and Neuroscience.  The Department of Pharmacology, Toxicology and Neuroscience offers an eight- week summer research program for domestic undergraduate students who are interested in pursuing a career in pharmacology. Students participate in laboratory research experiments and attend weekly lectures on topics that will help prepare them for success in research-intensive doctoral programs.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20Undergraduate%20Pharmacology%20Experience%20in%20Research%20Program%20(SUPER)%20application",
    "deadline": "January 31, 2021",
    "eligibility": "Students must submit an application, unofficial college transcript, and a brief statement of why you would like to participate in this internship program. Students must also ensure that one letter of recommendation is submitted. All letters of recommendation must be either emailed or mailed directly from the author. An applicant must be a United States citizen or Permanent Resident. Please email all application materials to Ty Martinez at tmoren@lsuhsc.edu.",
    "cost": "Free",
    "stipend": "Not specified",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer Undergraduate Research program, Department of Molecular Pharmacology and Therapeutics",
    "description": "Our program offers 10 weeks (~40 hrs/week) of intensive practical laboratory research experience in pharmacology with faculty members of the Department of Molecular Pharmacology & Therapeutics. Awardees will attend selected seminars by guest speakers, weekly discussions on basic concepts in pharmacology and professional development for the research scientists led by our faculty. Students will attend the Great Lakes Chapter meeting of the American Society of Pharmacology and Experimental Therapeutics. They will also attend a career panel and have an opportunity to tour a pharmaceutical facility. At the end of the fellowship each student will provide an oral presentation of their work to the Department. Summer research fellows will have an opportunity to compete for travel funds to attend the 2019 meeting of the American Society of Pharmacology and Experimental Therapeutics in Orlando Florida. Our research fellowship is designed to provide an opportunity for students to gain valuable biomedical research experience in pharmacology, particularly when research opportunities in their own college or university are limited.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20Undergraduate%20Research%20program%2C%20Department%20of%20Molecular%20Pharmacology%20and%20Therapeutics%20%20application",
    "deadline": "Application dates for 2021 TBA",
    "eligibility": "US citizen or permanent resident who will be enrolled as a Junior or Senior in a baccalaureate program or equivalent in the Fall 2019 term.",
    "cost": "Free",
    "stipend": "$5,200",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer Student Research Program at main Medical Center Research Institute",
    "description": "During the summer months Maine Medical Center Research Institute provides undergraduates with an opportunity to receive an educational experience in biomedical science through the MMCRI Summer Student Research Program. MMCRI also reserves several spots in the program for MMC Tufts Maine Track students. Learn more about the medical student portion of the program.\r\n\r\nResearch at MMCRI covers a broad area in biomedical science including vascular biology, stem cell biology, developmental biology, neurobiology, hematology, nephrology, tumor biology, and molecular genetics as well as outcomes research, vector-borne diseases, and clinical research.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20Student%20Research%20Program%20at%20main%20Medical%20Center%20Research%20Institute%20application",
    "deadline": "2021 Application Dates TBA",
    "eligibility": "In order to be eligible for participation in the MMCRI Summer Student Research Program you must meet the following eligibility requirements:\n\nApplicants must be 18 years old by June 4, 2018\nApplicants must have a 3.0 GPA or above\nApplicants must be enrolled as a full-time student in an undergraduate college program or community college program, or be a high school senior moving to a full-time undergraduate college program starting in the fall of 2018. College seniors who will have graduated by the time the Summer Student Research Program starts in June 2018 are not eligible for the program.\nAll Summer Student Research Program participants become employees of Maine Medical Center, so you must be eligible to be employed in the US in order to participate in this program.\nYou must also be available to come to MMC for required pre-employment health screening over the course of a 48 hour period prior to the start of the program.",
    "cost": "Free",
    "stipend": "$4,600",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "MGH Summer Research Trainee Program (SRTP)",
    "description": "Each summer, twenty students are selected from a nationwide competition to join SRTP. Each student is assigned to a specific MGH laboratory, clinical site, health policy, or health services research area where they undertake an original research project under the mentorship and guidance of a Mass General Hospital (MGH) investigator. Assignments are carefully considered and are made with the student's research and career interests in mind. In addition to this unique research experience, students will gain knowledge through weekly seminars at MGH, attend career development workshops and networking events, and have opportunities for clinical shadowing.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=MGH%20Summer%20Research%20Trainee%20Program%20(SRTP)%20application",
    "deadline": "2021 Application Dates TBA",
    "eligibility": "SRTP seeks students who are interested in pursuing a career in academic medicine or biomedical research and meet the following criteria:\n\nMember of a group that is underrepresented in medicine (URM)*\nUndergraduate junior or senior, rising 1st year medical student, or 1st year medical student, graduate school student, or post-baccalaureate student (note: freshman and sophomores not eligible)\nAttended/attending a college or medical school in the US and Puerto Rico\nUS citizens or permanent residents\nIf accepted, proof of health insurance required\n",
    "cost": "Free",
    "stipend": "$5,000",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer Program for Undergraduate Research",
    "description": "The Summer Program for Undergraduate Research (SPUR) has been offered at the Medical College of Wisconsin for over 30 years. During that time, SPUR has hosted hundreds of students who have since made significant contributions to science and humanity through their current positions as teachers, instructors, professors, researchers, industry professionals, government leaders and clinicians.  SPUR hosts roughly 25-30 participants each summer from across the country who gain valuable research experience, refine critical thinking skills, build upon academic and professional networks and are introduced to various disciplines of science.  Participation in SPUR is intended for students who are currently enrolled at an accredited college or university who intend to pursue scientific-based graduate studies.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20Program%20for%20Undergraduate%20Research%20application",
    "deadline": "February 1, 2021",
    "eligibility": "All students enrolled in a U.S.-based, regionally accredited college/university are encouraged to apply. Preference is typically given to current sophomores and juniors with a GPA of 3.2 or higher that have an interest in research-based graduate studies. Those chosen to participate in SPUR must be 18 years or older by the program start date.",
    "cost": "Free",
    "stipend": "$3,500",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Medical Student Summer Fellowship Research Program",
    "description": "Memorial Sloan Kettering Cancer Center’s Medical Student Summer Fellowship Program is a research program for first- and second-year students at US medical schools who are interested in careers as physician-scientists in the field of oncology and/or related biomedical sciences.\nFunded since 1977 by the National Cancer Institute, this program grants students the opportunity to conduct basic laboratory or clinical research under the mentorship of MSK faculty. Additional support is provided by MSK’s Office of Diversity Programs in Clinical Care, Research, and Training.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Medical%20Student%20Summer%20Fellowship%20Research%20Program%20application",
    "deadline": "December 11, 2020",
    "eligibility": "Selection criteria for applicants may include:\r\n\r\nDemonstrated academic and research background related to the project(s)\r\nInterest in the specific project(s), as stated in the applicant’s personal and/or research preference statement\r\nAs part of the review process, some faculty may request a phone interview",
    "cost": "Free",
    "stipend": "biweekly pay. 10 week program",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer Research Internships in Clinical Cardiology",
    "description": "Summer Research Internships in Clinical Cardiology - Summer health professions and research program",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20Research%20Internships%20in%20Clinical%20Cardiology%20application",
    "deadline": "January 6, 2021",
    "eligibility": "Undergraduate students",
    "cost": "Free",
    "stipend": "Not specified",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer Internship Program in Biomedical Research",
    "description": "Summer programs at the National Institutes of Health (NIH) provide an opportunity to spend a summer working at the NIH side-by-side with some of the leading scientists in the world, in an environment devoted exclusively to biomedical research (At the NIH \"biomedical sciences\" includes everything from behavioral and social sciences, through biology and chemistry, to physics, mathematical modeling, computational biology, and biostatistics). ",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20Internship%20Program%20in%20Biomedical%20Research%20application",
    "deadline": "March 1, 2021",
    "eligibility": "Eligibility criteria for NIH SIP 2019 will be posted in fall 2018.",
    "cost": "Free",
    "stipend": "Not specified",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer Research Opportunity Program",
    "description": "The Summer Research Opportunity Program (SROP) is an eight-week competitive research experience at Northwestern University for sophomores and juniors from colleges and universities across the United States. All fields of research at Northwestern are open to SROP participants including the social sciences and humanities, physical sciences, chemical and biological sciences, technology, math and engineering fields. ",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20Research%20Opportunity%20Program%20application",
    "deadline": "February 11, 2021",
    "eligibility": "To be considered for acceptance into SROP, you must:\n\nBe a current sophomore or junior.\nHave a cumulative GPA of at least 3.3 on a 4.0 scale.\nBe a U.S. citizen or permanent resident.\nHave an interest in pursuing a doctoral degree (PhD) at Northwestern University. Those interested in pursuing an MBA, JD, or MD are not eligible.",
    "cost": "Free",
    "stipend": "$4,500",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "SURIP – Summer Undergraduate Research Internship Program",
    "description": "The SURIP program is intended for college students who are interested in pursuing a career in the biological sciences. SURIP is most appropriate for students considering application to PhD programs in the biomedical sciences and is not intended for students who plan to apply to medical school. There is no clinical shadowing component to the internship.Students who are undecided or interested in combined degrees are welcome to apply.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=SURIP%20%E2%80%93%20Summer%20Undergraduate%20Research%20Internship%20Program%20application",
    "deadline": "February 5, 2021",
    "eligibility": "Undergraduate students",
    "cost": "Free",
    "stipend": "$3,000",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "American Heart Association - Undergraduate Student Fellowship Program (AHA-USF)",
    "description": "The Penn State Health and Penn State College of Medicine American Heart Association - Undergraduate Student Fellowship (AHA-USF) Program in Cardiovascular Disease is supported by a grant from the American Heart Association.\r\n\r\nThe program provides support for students to spend 10 weeks in a biomedical research laboratory focused on cardiovascular research. The students in the AHA-USF program participate in weekly career development workshops and research seminars, in which students will have the opportunity to interact with basic science researchers and clinical cardiologists.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=American%20Heart%20Association%20-%20Undergraduate%20Student%20Fellowship%20Program%20(AHA-USF)%20application",
    "deadline": "February 5, 2021",
    "eligibility": "Undergraduate students",
    "cost": "Free",
    "stipend": "$4,000",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Short-Term Educational Program for Underrepresented Persons (STEP-UP",
    "description": "The STEP-UP Summer Internship Program Short-Term Research Experience for Underrepresented Persons (STEP-UP) is a federally funded program managed and supported by the Office of Minority Health Research Coordination (OMHRC) in the National Institutes of Diabetes and Digestive and Kidney Diseases (NIDDK) of the National Institutes of Health (NIH).\r\nThe overall goal of NIDDK’s STEP-UP program is to build and sustain a biomedical, behavioral, clinical and social science research pipeline focused on NIDDK mission areas.STEP-UP provides an opportunity for students from diverse backgrounds and communities to participate in summer research in the areas of diabetes, nutrition, obesity, and digestive, kidney, and hematological diseases.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Short-Term%20Educational%20Program%20for%20Underrepresented%20Persons%20(STEP-UP%20application",
    "deadline": "Mid February\n",
    "eligibility": "Undergraduate students",
    "cost": "Free",
    "stipend": "$4,500",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Stanford Summer Research Program (SSRP)/Amgen Scholars",
    "description": "The SSRP-Amgen Scholars Program is a fully-funded research-intensive residential program that takes place on Stanford’s beautiful campus for a nine-week period. Participants are matched with a member of Stanford’s distinguished faculty and work in one of our state-of-the-art research facilities. Each participant works with both a faculty member and a lab mentor to craft a research project. The lab environment provides challenging projects and involves a broad range of research techniques that are feasible within the nine-week period. The program culminates with a research symposium, where students present individual talks and posters on their summer projects in front of their peers, faculty, lab mentors, University administrators, and general public.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Stanford%20Summer%20Research%20Program%20(SSRP)%2FAmgen%20Scholars%20application",
    "deadline": "February 1, 2021",
    "eligibility": "U.S. citizens or U.S. permanent residents;\nUndergraduate students enrolled in accredited four-year colleges or universities in the United States, Puerto Rico or other U.S. territories; and\nSophomores, juniors, or non-graduating seniors (who are returning in the fall after SSRP to continue undergraduate studies).\nStudents who, by reason of their culture, class, race, ethnicity, disability, background, work and life experiences, and/or skills and interests would bring diversity (broadly defined) to graduate study in the biomedical and biological sciences.\nA cumulative grade point average of 3.2 or above; and\nAn interest in pursuing a PhD (or, in exceptional cases, those interested in the MD/PhD will also be considered)",
    "cost": "Free",
    "stipend": "$3,600",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "2021 Summer Undergraduate Research Program",
    "description": "Each year, SURP students will conduct research in the laboratories of CMMG faculty members and attend weekly SURP/SURE research seminars. In early August, SURP students present the results from their summer projects to mentors, peers and other Wayne State University research faculty at a Minisymposium.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=2021%20Summer%20Undergraduate%20Research%20Program%20application",
    "deadline": "March 31, 2021",
    "eligibility": "Applicants to SURP must be either US Citizens or Permanent Residents.",
    "cost": "Free",
    "stipend": "$2,500",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer Accelerated Biomedical Research (SABR) Program",
    "description": "Summer Accelerated Biomedical Research (SABR) is located in Lubbock, TX and affiliated with the Biomedical Science s Ph.D. program.\r\n\r\nThe Graduate School of Biomedical Sciences has faculty involved in many relevant, interesting research areas with state-of-the art labs and equipment.  The SABR Program is an excellent educational opportunity, with a commitment to fostering its intern's desire for science and research.  Our program is intended for undergraduate students or current graduates who wish to gain more research experience before entering graduate school. ",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20Accelerated%20Biomedical%20Research%20(SABR)%20Program%20%20application",
    "deadline": "Application dates for 2021 TBA",
    "eligibility": "To be eligible for this program we ask that you are an undergraduate who has interest in performing scientific research and attending graduate school. Applicants who are currently enrolled in graduate school will not be eligible for review. Applicants taking post-baccalaureate classes with the intent to enter graduate school will be considered on a case-by-case basis. ",
    "cost": "Free",
    "stipend": "$3,800",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Sackler School Summer Research Programs",
    "description": "The Building Diversity in Biomedical Sciences (BDBS) Program offers a ten week, mentored research experience for students interested in pursuing future PhD or MD/PhD studies.  The Program typically begins around Memorial Day and ends in early August.  Trainees also attend scientific seminars and workshops on academic and career guidance, participate in organized social activities, and have free time to explore the Boston area. ",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Sackler%20School%20Summer%20Research%20Programs%20application",
    "deadline": "February 15, 2021",
    "eligibility": "Applicants must have successfully completed at least one year of college and be US citizens or US permanent residents to participate in this summer program.  Students who will graduate before the summer program starts are not eligible for BDBS, but might wish to consider our PREP program.\r\n\r\nThe NIH and the Sackler School encourage applicants from members of groups that are under-represented in the biomedical sciences. The NIH has reported that groups under-represented in biomedical or behavioral research include African-American, Hispanic-American or Latino/a, American Indian, Alaskan Native, and Pacific Islander and members of economically disadvantaged families and disabled persons.",
    "cost": "Free",
    "stipend": "$4,000",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer in Biomedical Sciences (SIBS) Undergraduate Research Program",
    "description": "The Summer in Biomedical Science (SIBS) Undergraduate Research Program provides an opportunity for young people who are sophomore or junior level college undergraduates to be instructed in the techniques of modern biology while becoming integrated members of a vibrant clinical and scientific community. ",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20in%20Biomedical%20Sciences%20(SIBS)%20Undergraduate%20Research%20Program%20application",
    "deadline": "February 12, 2021",
    "eligibility": "Sophomore or junior level college undergraduates.\nUS Citizens or Permanent Residents are eligible to apply; International Students are not eligible.",
    "cost": "Free",
    "stipend": "$3,200",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer Programs for Undergraduate Research",
    "description": "The UCLA Summer Programs for Undergraduate Research (SPUR) offer upper division undergraduate students with outstanding academic potential the opportunity to work closely with faculty mentors on research projects. The programs are designed for students who wish to learn more about the graduate school experience and possibly pursue an academic career in teaching and research. Opportunities are available in virtually all academic fields (e.g., arts, humanities, social sciences, life sciences, health sciences, physical sciences, etc.).",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20Programs%20for%20Undergraduate%20Research%20application",
    "deadline": "March 31, 2021",
    "eligibility": "Varys between programs",
    "cost": "Free",
    "stipend": "$3,500",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "MEDICAL SCIENTIST TRAINING PROGRAM",
    "description": "Students selected for summer research at UC San Francisco spend up to ten weeks working with UCSF faculty members on research projects. Participants in the program take part in seminars, lectures, and social events, creating a cohesive and supportive community. At the end of the program, students give presentations of their research and get valuable feedback from students, postdocs, and faculty at UCSF.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=MEDICAL%20SCIENTIST%20TRAINING%20PROGRAM%20application",
    "deadline": "January 31, 2021",
    "eligibility": "Be a currently-enrolled undergraduate student. (We cannot accept students who will have earned their bachelor's degree by the end of the spring 2019 quarter.)\r\nBe a U.S. citizen or permanent resident.\r\nHave a desire to pursue a PhD in one of the disciplines offered by the UCSF Graduate Division in life/health sciences listed below.\r\nHave completed at least four semesters or six quarters of undergraduate study prior to the beginning of the Summer Program.\r\nBe able to participate for the entirety of the program.\r\n",
    "cost": "Free",
    "stipend": "$4,000",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "The Leadership Alliance & The University of Chicago Summer Research Early Identification Program",
    "description": "Leadership Alliance programs foster intellectual and professional growth along every stage of the academic and career path. Opportunities for training and mentoring begin with undergraduates during the academic year and continue during the summer with the First-Year Research Experience (FYRE) program, which enables first-year students to conduct research in the Summer Research Early Identification Program (SR-EIP). Undergraduates of every discipline participate in the SR-EIP through an application open to students enrolled at all U.S. colleges and universities. They present their research at the Leadership Alliance National Symposium (LANS). For graduate students, postdocs, junior faculty and Leadership Alliance Doctoral Scholars, LANS is an opportunity for further mentoring and professional development. In the Career Development Workshop and Grant Writing Coaching Groups, they build skills and meet mentors that help bring a truly diverse and representative research workforce into being. Doctoral Scholars, faculty, and administrators remain engaged through our Speaker Series where they share their stories of becoming researchers and of transforming the research workforce.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=The%20Leadership%20Alliance%20%26%20The%20University%20of%20Chicago%20Summer%20Research%20Early%20Identification%20Program%20application",
    "deadline": "2021 Application dates TBA",
    "eligibility": "Be currently enrolled full-time in an accredited public or private college or university in the United States or its territories, as recognized by the U.S. Department of Education.\r\nBe in good academic standing with a GPA of 3.0 or better.\r\nDemonstrate a committed interest to pursue graduate study toward a PhD or MD-PhD.\r\nHave completed at least two semesters and have at least one semester remaining of their undergraduate education by the start of the summer program.\r\nBe a documented U.S. citizen or non-citizen national, or permanent resident in possession of an alien registration receipt card (I-551) or other legal document of such status at the time of application. International citizens studying in the United States with an F-1 Visa are not eligible for the SR-EIP. Individuals seeking asylum or refugees are not eligible.",
    "cost": "Free",
    "stipend": "yes",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Pritzker School of Medicine Experience in Research",
    "description": "Students will participate in either basic science laboratories or clinical research projects throughout the duration of the program.  The program concludes with a mandatory research presentation forum at the end of the summer.  Weekly cluster groups will support the laboratory research work of each participant. These groups will explore medical and research ethics, health care disparities, statistics and research tools. Students will also receive mentorship and guidance from Pritzker Medical School students and staff. This includes advising sessions with Pritzker admissions officers and social events with Pritzker andUniversity of Chicago summer research program students.\r\n\r\nParticipants will live on campus at the University of Chicago for the 8 week experience in order to foster the same sense of community and cooperative learning that exists among our medical school students. Participants will not be permitted to work part-time jobs, take any additional classes during the program, or be involved in any formal or informal MCAT or application preparation process for medical school during the program. There will be considerable lab work to conduct and out-of-lab/classwork to prepare.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Pritzker%20School%20of%20Medicine%20Experience%20in%20Research%20application",
    "deadline": "Currently accepting applications",
    "eligibility": "Applicants must be US citizens or have Permanent Resident status. The program seeks students who come from disadvantaged backgrounds and/or who represent groups that are known to be underrepresented in health related sciences and medicine. \r\n\r\nDue to the nature of the NIH grant that supports PSOMER, participants cannot be appointed to another NIH training award (such as a T32 or an individual F series fellowship) or supported by a federal research grant during the program period",
    "cost": "Free",
    "stipend": "$3,200",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Graduate Experience for Multicultural Students (GEMS)",
    "description": "The overarching goal of the GEMS program is to support the development of future biomedical scientists by providing undergraduate students with research opportunities and exposure to the realistic lifestyle of biomedical research.  Therefore we are looking for students who plan to pursue a lifelong career in research.\r\n\r\nSelected undergraduate GEMS interns will participate in an intense ten-week summer research internship program, from June 3 through August 9, 2019. The program will consist of lectures, professional-development workshops, and a mentored laboratory research assignment. Participating laboratories are drawn from basic sciences as well as clinical sciences Departments at the UC-Denver Anschutz Medical Campus (UCD-AMC) including (but not limited to) pulmonary medicine, cardiology, pediatrics, biochemistry and molecular genetics, cell and developmental biology, cancer biology, human medical genetics, immunology, microbiology and molecular biology.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Graduate%20Experience%20for%20Multicultural%20Students%20(GEMS)%20application",
    "deadline": "February 1, 2021",
    "eligibility": "Students from around the nation (continental US and US territories) are welcome to apply. GEMS interns are selected on the basis of interest in biomedical science research careers, academic achievement and inclusion in an underrepresented group or category (first generation college attendee, low income, financial need, or ethnic identity as African American, Hispanic, American Indian, Alaska Native, or Southeast Asian, Pacific Islander). Successful undergraduate applicants will have completed two years of college and demonstrated aptitude in one or more laboratory science courses. Those who will have already graduated by the start of the program and international students (with student visas) are not eligible.  ",
    "cost": "Free",
    "stipend": "$4,000",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Undergraduate Summer Research",
    "description": "UConn Health invites applications for a limited number of summer research internships from highly qualified and motivated undergraduate students who have completed at least their sophomore year by the start of the program and have an interest in obtaining a Ph.D. in the biological and biomedical sciences. Students will have the opportunity to participate in research activities of a laboratory at the Graduate School under the direction of a faculty member. The purpose of the program is to provide a research experience and the opportunity to learn about ongoing research programs at UConn Health.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Undergraduate%20Summer%20Research%20application",
    "deadline": " Application dates for 2021 TBA",
    "eligibility": "Applicants who are U.S. citizens/Permanent Residents or international students who have an F-1 student visa and are currently undergraduates studying in a college or university in the United States (as long as they obtain “curricular practical training” from their current U.S. college or university) are eligible to apply.\r\n\r\nInternational students on any other visa type are not eligible for the program.\r\n\r\nApplicants must have completed at least their sophomore year by the start of the program and should have completed some college coursework in biology and chemistry (preferably through organic chemistry). Previous laboratory experience is desirable. Students who will have graduated by the time the program begins are not eligible.\r\n\r\nApplicants must submit an application with an essay, transcript, standardized test scores, and two letters of recommendation (see details below).\r\n\r\nStudents who have previously participated in the program are not eligible to reapply.",
    "cost": "Free",
    "stipend": "$3,500",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer Undergraduate Fellowsip in Genetics (SUNFIG)",
    "description": "The Department of Genetics of the University of Georgia invites undergraduates interested in a career in genetics research to apply for positions in our summer research program. Students will be matched with a faculty mentor in the Department of Genetics and participate in research as a member of a research team. The faculty member will help design and monitor an appropriate full-time research project for the student or incorporate the student into ongoing research. Participants will be expected to devote at least a 40-hour week to this program. At the conclusion of the program, the student will prepare an abstract, data summary, and conclusions drawn from the work and present them in a poster format to other students and to the department.\n\nResearch in the areas of biotechnology, developmental genetics, ecological genetics, eukaryotic molecular genetics, evolutionary genetics, genomics, bioinformatics, molecular evolution, and prokaryotic molecular genetics is available within the Department of Genetics.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20Undergraduate%20Fellowsip%20in%20Genetics%20(SUNFIG)%20application",
    "deadline": "Application dates for 2021 TBA",
    "eligibility": "We are particularly interested in applications from students in groups currently underrepresented in the sciences who have completed their junior year in college and who have a strong academic record in the sciences. Applicants must be attending a college or university in the U.S. and must be a U.S. Citizen to apply for the SUNFIG program. Students currently enrolled at the University of Georgia are not eligible for this program.",
    "cost": "Free",
    "stipend": "$2,300",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "The Summer Research Opportunities Program (SROP)",
    "description": "The Summer Research Opportunities Program (SROP) was first established in 1986 by the Graduate Deans of the Committee on Institutional Cooperation (CIC). The goal of SROP is to introduce domestic underrepresented sophomores and juniors to academic research experiences. Student participants work one-on-one with a faculty mentor giving them an opportunity to experience research and the graduate student experience.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=The%20Summer%20Research%20Opportunities%20Program%20(SROP)%20application",
    "deadline": "February 5, 2021",
    "eligibility": "Traditionally sophomores and juniors from historically underrepresented ethnic minority groups who have a 3.75 (on a 5.0 scale) or  2.75 (on a 4.0 scale) or higher grade point average are invited to apply. Applicants must be U.S. citizens of permanent residents.",
    "cost": "Free",
    "stipend": "$4,000",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Biomedical Scholars Summer Undergraduate Research Program",
    "description": "The Biomedical Scholars Summer Undergraduate Research Program allows scholars to pursue broad research interests in modern biomedical research, which they may not have opportunities to pursue extensively in undergraduate coursework. Scholars will gain laboratory research experience, participate in a seminar program designed especially for this program, and have the opportunity to join in informal social events. This unique program provides research opportunities in the laboratories of faculty who belong to the graduate programs in Free Radical and Radiation Biology, Genetics, Human Toxicology, Immunology, Molecular Medicine and Neuroscience. The interdisciplinary nature of the program transcends traditional discipline-specific boundaries to provide an exciting research training experience. Please apply through the Biomedical Scholars Summer Undergraduate Research Program and select and rank your program of interest.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Biomedical%20Scholars%20Summer%20Undergraduate%20Research%20Program%20application",
    "deadline": "February 1, 2021",
    "eligibility": "Scholars who have completed the sophomore or junior year, majoring in any area of the biological sciences at an accredited four-year college or university are eligible. Women and members of underrepresented minority groups are encouraged to apply. This program is open to US citizens or permanent residents.",
    "cost": "Free",
    "stipend": "$5,000",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Summer Health Professions Education Program at the University of Iowa",
    "description": "The Summer Health Professions Education Program (SHPEP) is a FREE summer enrichment program focused on improving access to information and resources for college students interested in the health professions. SHPEP’s goal is to strengthen the academic proficiency and career development of students underrepresented in the health professions and prepare them for a successful application and matriculation to health professions schools. These students include, but are not limited to, individuals who identify as African American/Black, American Indian and Alaska Native and Hispanic/Latino, and who are from communities of socioeconomic and educational disadvantage.\n\nThe University of Iowa Health Sciences Colleges is pleased to offer an enriching six week experience with SHPEP. The Health Sciences Colleges include the Carver College of Medicine, College of Dentistry, College of Pharmacy, and College of Public Health. We strongly believe in the value of exposing students from underrepresented backgrounds to the possibility of pursuing health fields and supporting their goals in accomplishing that dream to help improve the health of society at large.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Summer%20Health%20Professions%20Education%20Program%20at%20the%20University%20of%20Iowa%20application",
    "deadline": "February 5, 2021",
    "eligibility": "Be a college freshman or sophomore at the time of application\r\nHave a minimum overall GPA of 2.5\r\nBe a U.S. citizen, a permanent resident, or an individual granted deferred action for childhood arrivals (DACA) status by the U.S. Citizenship and Immigration Services\r\nNot have previously participated in the program.",
    "cost": "Free",
    "stipend": "$600",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Biochemistry Summer Undergraduate Research Fellowship (BSURF)",
    "description": "The 10-week Biochemistry Summer Undergraduate Research Fellowship (BSURF), intended for students outside of the University of Iowa, is an excellent opportunity for undergraduate students to gain hands-on experience in an active research laboratory, under the direction of an established scientist. The research involves planning and performing experiments in order to answer questions of interest in contemporary biochemistry and research areas include structural biology, genetics, developmental biology and molecular biology. Please visit our faculty page for further information about research interests in the department.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Biochemistry%20Summer%20Undergraduate%20Research%20Fellowship%20(BSURF)%20application",
    "deadline": "2021 Program Cancelled. Applications for 2022 open in December 2021",
    "eligibility": "Have completed at least two years of college in a biological science (or related) major\r\nWill be returning for at least one year of undergraduate study before graduation\r\nAre interested in pursuing graduate school and a career in biological research\r\nStrong knowledge of organic chemistry and biology is advantageous",
    "cost": "Free",
    "stipend": "$4,250",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "UI Summer Research Opportunities Program (SROP)",
    "description": "The UI Summer Research Opportunities Program (SROP) is for you if you are interested in a challenging research experience. SROP is an award-winning eight-week program designed to provide promising underrepresented undergraduate students with in-depth research experiences. The SROP program strives to prepare young investigators to achieve their goals of pursuing graduate work and of becoming tomorrow's academic leaders as faculty or with successful careers in government, business, and non-profit agencies. Students receive first-hand exposure to the graduate school experience and to faculty life by being paired with a faculty mentor whose work is closely related to your academic interests and career goals. You will choose among opportunities in Biological Sciences, Engineering, Humanities, Mathematics, Physical Sciences, or Social Sciences and will work with your faculty mentor either on an individual basis or as part of a research team. Each student plays an active role in identifying the area of study and a faculty mentor to work with. The program encourages students to explore research opportunities at Iowa that can lead to doctoral degrees. The program culminates with the students presenting their research at the Summer Undergraduate Research Conference.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=UI%20Summer%20Research%20Opportunities%20Program%20(SROP)%20application",
    "deadline": "Application dates for 2021 TBA",
    "eligibility": "Undergraduate students",
    "cost": "Free",
    "stipend": "$3,500",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "NSF-REU: Summer Program in the Biomedical Sciences",
    "description": "The summer program in the Biochemical Sciences at the University of Kentucky is a ten-week program that involves undergraduates in cutting-edge biochemical research. The goal of the Program is to encourage student participants to pursue careers in the biochemical sciences. A wide variety of projects are offered, including research in structural biology, biophysics, proteomics, protein, and nucleic acid chemistry, membrane biochemistry, and molecular biology.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=NSF-REU%3A%20Summer%20Program%20in%20the%20Biomedical%20Sciences%20application",
    "deadline": "Application dates for 2021 TBA",
    "eligibility": "This REU Site Program is targeted at undergraduates who are residents of Appalachia and/or underrepresented minorities. Outstanding applicants from other groups will be considered. Selected participants must be enrolled as undergraduates at the freshman, sophomore or junior level during the semester prior to attending the Program.\nIt is a requirement of the NSF that all REU participants be citizens or permanent residents of the United States.",
    "cost": "Free",
    "stipend": "yes",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "University of Maryland Scholars Summer Research Program",
    "description": "The program seeks to provide talented UMCP STEM-track undergraduate students with an intense, comprehensive, and immersive mentored experience in research at the University of Maryland School of Medicine on the UMB campus. Research projects might be basic, clinical, translational or epidemiological in nature or focus.\r\nStudents selected for the program are typically interested in pursuing either health-profession degrees (especially the M.D. degree), and some are interested in pursuing graduate (e.g. Ph.D. track) research or M.D./Ph.D. or M.D./M.S. dual degree tracks. The program introduces these talented students to the vast array of health or biomedical research projects and topics, the possibilities of careers in medicine and biomedical research, and the variety of degree programs and opportunities at UMB while they execute a well-crafted project with their mentors.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=University%20of%20Maryland%20Scholars%20Summer%20Research%20Program%20application",
    "deadline": "Application dates for 2021 TBA",
    "eligibility": "Institution and Year of Study\r\nUniversity of Maryland, College Park (UMCP) undergraduate students currently in their second or third year of studies (Sophomore or Junior).\r\nStudy Field\r\nMajoring in any science, engineering, or mathematics field.\r\nGPA\r\nMinimum GPA of 3.2 (cumulative) with strong science preference. GPA of 3.5 or greater preferred.",
    "cost": "Free",
    "stipend": "$4,500",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "University of Massachusetts Medical School (UMMS) Summer Undergraduate Research Opportunity",
    "description": "The program consists of \"hands-on\" laboratory research with an investigator serving as a mentor, role model and advisor. \nThe program is designed to provide participants in-depth exposure to actual bio medical research. Participants will create career-building connections between researchers, post docs, graduate students, and peers. The program encourages participants to consider biomedical research as a viable career choice.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=University%20of%20Massachusetts%20Medical%20School%20(UMMS)%20Summer%20Undergraduate%20Research%20Opportunity%20application",
    "deadline": "March 1, 2021",
    "eligibility": "All participants must be at least eighteen years old, matriculating and a U.S. citizen or permanent resident to apply, GPA/must be in good academic standing. Participants cannot be receiving funding from any other sources during the program. Participants MUST have proof of health insurance coverage prior to acceptance to the program.College seniors who will have graduated by the time the program starts in June are not eligible.  \r\nWhen submitting an application please check off one of the following funding sources:\r\nTo be eligible for NIH funding at least ONE of the following requirements must apply:\r\nMember of a racial or ethnic group under-represented in biomedical research (African American, Native American [Hawaiian and Alaskan] and Hispanic/Latino)\r\nFamily meets criteria for disadvantaged (economic or educational) status\r\nPresently receive accommodations under the Americans with Disabilities Act",
    "cost": "Free",
    "stipend": "$4,000",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "University of Medicine and Dentistry of New Jersey Robert Wood Johnson Medical School and Rutgers University",
    "description": "Twelve outstanding applicants will be selected to join a research laboratory at Rutgers located in Piscataway and New Brunswick, NJ for a 10 week program, where they will engage in hands-on experimentation. Under the supervision of their faculty mentors, students will be expected to implement individual research projects during this period. This involves helping to formulate a hypothesis based on the mentor's previous studies, and learning laboratory skills, data collection and documentation.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=University%20of%20Medicine%20and%20Dentistry%20of%20New%20Jersey%20Robert%20Wood%20Johnson%20Medical%20School%20and%20Rutgers%20University%20application",
    "deadline": "Application dates for 2021 TBA",
    "eligibility": "Applicants must be United States citizens or permanent residents\nApplicants must have completed at least one year of college prior to the start of the program. Applicants who will have received their undergraduate degree prior to the start of the program are not eligible.\nApplicants should have good academic credentials including courses in biology.\nApplicants should be interested in pursuing research in their careers.\nApplicants from all schools are encouraged to apply. Special consideration will be given to minority groups that are underrepresented in the sciences, first-generation college students, or students who attend schools with limited research opportunities.\nApplicants already admitted to graduate or professional schools will not be considered.",
    "cost": "Free",
    "stipend": "$4,000",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "University of Michigan",
    "description": "Perform full-time research under the direction of a faculty mentor in a research laboratory.  (We are not able to provide opportunities in public health, the social sciences or humanities).\nGain clinical exposure by participating in two half-day physician shadowing experiences.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=University%20of%20Michigan%20application",
    "deadline": "February 1, 2021",
    "eligibility": "Come from an educational, cultural or geographic background that is underrepresented in the sciences.\nOR\nHave experienced financial hardship as a result of family economic circumstances.\nOR\nHave a physical or mental disability that substantially limits one or more major life activities.\nAND\nBe a current undergraduate (those applying to Med/Grad School for 2019 are not eligible).\nCompleted sophomore undergraduate year by June 1, 2019.\nBe a US citizen or permanent resident of the United States.\nCompleted either an organic chemistry course preferably with lab or a biology course (physiology, biology, biochemistry) preferably with lab.\nHave completed 100 hours of experience in a research lab (this is in addition to a course with a lab) by June 1, 2019.\nSubmit two letters of recommendation, one of which must be from a research mentor or the instructor of a laboratory course.\nMaintain a 3.2 grade point average.\nShow proof of health insurance coverage.",
    "cost": "Contact program",
    "stipend": "$4,400",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "University of Mississippi SURE",
    "description": "The SURE students are placed in laboratories at the University of Mississippi Medical Center under the mentorship of a biomedical researcher. In addition to the laboratory experience, students attend seminars and discussions aimed at enhancing their understanding of the current status of biomedical research and the career opportunities available. Students may also participate in weekly journal clubs and seminars, as well as taking part in various social and networking activities.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=University%20of%20Mississippi%20SURE%20%20application",
    "deadline": "February 1, 2021",
    "eligibility": "Undergraduate students",
    "cost": "Contact program",
    "stipend": "$4,000",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "University of Nebraska - Lincoln Summer Research Program",
    "description": "This intensive summer research experience provides mentoring and research experiences while allowing scholars to preview graduate school life. Students with a strong interest in graduate programs are particularly encouraged to apply, as are those from populations traditionally underrepresented in graduate education.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=University%20of%20Nebraska%20-%20Lincoln%20Summer%20Research%20Program%20application",
    "deadline": "2021 deadlines vary",
    "eligibility": "Participation in the Nebraska Summer Research Program is limited to students who meet the following criteria:\r\nU.S. Citizen or Permanent Resident\r\nCurrent undergraduate with at least one semester of coursework remaining before obtaining a bachelor's degree (E.g., students graduating in May are not eligible for the Summer Research Program for the summer in which they graduate.)\r\nEach research program may have unique criteria or prerequisites, learn more by visiting the research programs pages.\r\n\r\nPreference will be given to students based on these criteria:\r\nCompletion of advanced coursework related to the research area\r\nJunior or senior standing with one year of remaining undergraduate coursework\r\nEvidence of interest in pursuing an advanced degree (master's or Ph.D.)",
    "cost": "Contact program",
    "stipend": "$5,000 - 6,000",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "University of Nebraska Medical Center SURP",
    "description": "The UNMC Summer Undergraduate Research Program (SURP) is a collaboration between UNMC departments, institutes, colleges, student services, and graduate specialty areas to provide summer opportunities for undergraduate students to become members of research teams and discover first-hand the broad spectrum of research activities occurring at UNMC. Each summer there are 80-100 positions available for talented undergraduate students mentored by awarded faculty. These full-time research positions are primarily in research laboratories where  students work with team members on an ongoing research project. SURP students attend weekly seminars provided by UNMC researchers to enhance their knowledge about research careers and the variety of research at UNMC. The laboratory experiences obtained by SURP students enhance their competitiveness for later admission to graduate programs at UNMC. ",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=University%20of%20Nebraska%20Medical%20Center%20SURP%20application",
    "deadline": "February 15, 2021",
    "eligibility": "U.S. Citizen or permanent resident. \nCurrently enrolled as a freshman, sophomore, junior or a December graduate in college.\ngraduated seniors will not be given consideration",
    "cost": "Free",
    "stipend": "Not specified",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "University of New Mexico School of Medicine: Undergraduate Pipeline Network Summer Research Experience",
    "description": "The Undergraduate Pipeline Network summer research experience seeks to cultivate students' interest in research while helping them attain skills needed to apply for and succeed in post-baccalaureate education. The program provides the opportunity for students to choose from several areas of research at the University of New Mexico's Health Sciences Center.  The program period covers 10 weeks in the summer and scholars participate in the program a minimum of 40 hours per week.\n\nThe University of New Mexico Health Sciences Center is a cutting edge health research center with more than $145 million in grants each year and more than 20 current clinical trials. New Mexico is rich with scientific and technological capabilities, which allows our researchers to take advantage of nearby resources by combining regional scientific strengths into our programs. UNM faculty and students regularly collaborate with scientists from Sandia National Laboratories, Los Alamos National Laboratory, and Lovelace Respiratory Research Institute; and with scientists at New Mexico State University. \n\nEach scholar is mentored during the program by a faculty member. In addition, scholars will have regular contact with a graduate student, post-doctoral fellow, medical resident, clinical fellow, or research staff member during the entire period of their program.\n\nEach scholar has a research project that provides the student with sufficient opportunity to demonstrate his/her ability to conduct independent research. Scholars will present their research project to the scientific community during the program’s competitive poster symposium.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=University%20of%20New%20Mexico%20School%20of%20Medicine%3A%20Undergraduate%20Pipeline%20Network%20Summer%20Research%20Experience%20application",
    "deadline": "Feburary 1, 2021",
    "eligibility": "Have a minimum 3.0 GPA.\nBe an enrolled undergraduate at the time of the program and a graduation date no earlier than the December following the program.\nCurrently attend a college or university in the United States.\nBe a US Citizen or Permanent Resident (green card holder).",
    "cost": "Free",
    "stipend": "$5,000",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "University of Oklahoma Health Sciences Center: Native American Center for Health Research Summer Undergraduate Research Experience",
    "description": "The Graduate College at the OU Health Sciences Center hosts four summer undergraduate research programs aimed at preparing and encouraging undergraduate students to pursue careers in biomedical research or health related sciences. Studies show that undergraduate research programs are beneficial to the success of applying to and completion of a graduate degree program. Our programs introduce outstanding undergraduate students to the rigorous academic preparation required to achieve these goals, through participation in intensive, hands-on research experiences in the laboratories of OUHSC biomedical faculty mentors. ",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=University%20of%20Oklahoma%20Health%20Sciences%20Center%3A%20Native%20American%20Center%20for%20Health%20Research%20Summer%20Undergraduate%20Research%20Experience%20application",
    "deadline": "January 31, 2021",
    "eligibility": "Must be a member of any Oklahoma Tribe; preference will be given to Cherokee, Chickasaw, Choctaw, Muscogee, and Seminole tribal members.\nHave completed 2 years of undergraduate study at an institution in the United States and be currently enrolled in good standing. Record of high academic achievement in science course work and experience in laboratory research or health sciences is desired.\nTwo letters of recommendation from faculty mentors or instructors are required and should highlight the applicant’s achievements in course work and laboratory experiences, and include an evaluation of his or her desire for a biomedical research or health science related career.\nA statement of career goals that includes a brief discussion of the applicant’s interest and future goals.",
    "cost": "Free",
    "stipend": "$6,000",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "University of Oklahoma Health Sciences Center: Summer Undergraduate Research Experience",
    "description": "The Graduate College at the OU Health Sciences Center hosts four summer undergraduate research programs aimed at preparing and encouraging undergraduate students to pursue careers in biomedical research or health related sciences. Studies show that undergraduate research programs are beneficial to the success of applying to and completion of a graduate degree program. Our programs introduce outstanding undergraduate students to the rigorous academic preparation required to achieve these goals, through participation in intensive, hands-on research experiences in the laboratories of OUHSC biomedical faculty mentors. ",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=University%20of%20Oklahoma%20Health%20Sciences%20Center%3A%20Summer%20Undergraduate%20Research%20Experience%20application",
    "deadline": "January 31, 2021",
    "eligibility": " An undergraduate student who has completed over 60 credit hours.\n\n A United States citizen or permanent resident or have unrestricted employment authorization in accordance with applicable Immigration and Naturalization Service regulations (example: J-2 with Employment Authorization Document or F-1 with approval from your education institutes International Services Office). Applicants with an H-4 visa are NOT eligible. \n\nWilling and able to commit to the program’s entire eight-week time frame.\n\nScholars are selected based on aptitude and interest in science and math, academic standing, essays and recommendation letters written as part of the application process.",
    "cost": "Free",
    "stipend": "$5,000",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "University of Oklahoma Health Sciences Center: Stephenson Cancer Center Summer Undergraduate Program",
    "description": "The  CURE Program offers students a chance to receive intensive hands-on training and experience in active research laboratories over an eight-week summer program. In addition, the scholars will also be a part of a journal club and many other exciting opportunities. \nAt the conclusion of the program, students participate in a poster presentation to gain experience in organizing, interpreting, and discussing their research results.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=University%20of%20Oklahoma%20Health%20Sciences%20Center%3A%20Stephenson%20Cancer%20Center%20Summer%20Undergraduate%20Program%20application",
    "deadline": "Application dates for 2021 TBA",
    "eligibility": "An undergraduate student who has completed between 60 and 100 credit hours.\n\nA United States citizen or permanent resident or have unrestricted employment authorization in accordance with applicable Immigration and Naturalization Service regulations (example: J-2 with Employment Authorization Document or F-1 with approval from your education institutes International Services Office). Applicants with an H-4 visa are NOT eligible. \n\nWilling and able to commit to the program’s entire eight-week time frame, which begins May 20, 2019 and ends July 12, 2019.",
    "cost": "Free",
    "stipend": "Not specified",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "University of Pennsylvania: Summer Undergraduate Internship Program (SUIP)",
    "description": "The SUIP provides an intense research experience to students interested in graduate study in the biomedical and biological sciences. The program has been in existence since 1993. Approximately 30 college students from across the US participate each year; most are rising juniors and seniors, but occasionally we admit a rising sophomore. Interns complete ten weeks of full-time laboratory research, attend state-of-the-art research seminars, receive career counseling from program faculty and administrators, and attend The Leadership Alliance National Symposium. The program seeks to encourage and prepare talented students to pursue careers in scholarly research.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=University%20of%20Pennsylvania%3A%20Summer%20Undergraduate%20Internship%20Program%20(SUIP)%20application",
    "deadline": "Application dates for 2021 TBA",
    "eligibility": "We encourage applications from students of all backgrounds, particularly those from underrepresented minority groups or disadvantaged backgrounds; with disabilities; or who attend small colleges. SUIP only accepts applications from U.S. citizens and permanent residents. We cannot accept applications from international students at this time. In addition, graduating seniors are not eligible to participate, and preference is given to applicants who will have completed their sophomore or junior year.",
    "cost": "Free",
    "stipend": "Not specified",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "University of Pennsylvania: Undergraduate Clinical Scholars Program",
    "description": "This is a 10 week rigorous summer research enrichment program starts the week of June 10, 2019.  The program is open to students from any accredited university in the United States and is designed specifically for undergraduate students with an interest in clinical/epidemiologic research, with an eventual goal of MD, PhD, or MD-PhD degrees.  Preference will be given to non-graduating college students.  At this time, we are not accepting graduate or post-baccalaureate students.\n\nThe 10 week program includes weekly didactic lectures and statistics workshops as well as a hands-on program-long research experience with an expert clinical investigator.  Weekly lectures and workshops will provide an introduction to epidemiologic and biostatistical topics, and will be paired with small group discussions or workshops to reinforce content presented in lectures.  Additional lectures will include topics on practical aspects of clinical research including as well human subjects and research ethics, writing abstracts and scientific manuscripts, and admissions to graduate programs.",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=University%20of%20Pennsylvania%3A%20Undergraduate%20Clinical%20Scholars%20Program%20application",
    "deadline": "January 8, 2021",
    "eligibility": "Undergraduate students",
    "cost": "Free",
    "stipend": "Not specified",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Columbia University: Summer Public Health Scholars Program (SPHSP)",
    "description": "This is an 8 week summer mentorship program beginnig May 8, 2019 for juniors, seniors and recent bachelors degree graduates to learn about the public health field. This program will include public health coursework, hands on experience within various public health settings, field trips to different public health facilities within urban new york, and seminars plus lectures from various public health leaders. ",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Columbia%20University%3A%20Summer%20Public%20Health%20Scholars%20Program%20(SPHSP)%20application",
    "deadline": "January 31, 2021",
    "eligibility": "U.S. Citizen, Permanent Resident, or U.S. National",
    "cost": "Free",
    "stipend": "yes",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "Feinstein Summer Research Internship Program",
    "description": "https://redcap.northwell.edu/surveys/?s=KFHCP9TK9J",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=Feinstein%20Summer%20Research%20Internship%20Program%20application",
    "deadline": "March 1, 2021, at 11:59pm EST.",
    "eligibility": "Undergraduate students",
    "cost": "Contact program",
    "stipend": "All accepted students will receive a stipend of $2,000 to offset living expenses and travel during the duration of the program.",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "NASA Spring Internships Stem",
    "description": "NASA Spring Internships Stem - Summer health professions and research program",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=NASA%20Spring%20Internships%20Stem%20application",
    "deadline": "March 5, 2021",
    "eligibility": "Undergraduate students",
    "cost": "Contact program",
    "stipend": "Not specified",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "NASA Spring Internships Pathways",
    "description": "NASA Spring Internships Pathways - Summer health professions and research program",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=NASA%20Spring%20Internships%20Pathways%20application",
    "deadline": "Check program website",
    "eligibility": "Undergraduate students",
    "cost": "Contact program",
    "stipend": "Not specified",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "2021 Summer Student Worker Program-Pfizer",
    "description": "http://host.pcrecruiter.net/pcrbin/jobboard.aspx?uid=pfizer.atriumstaffing&src=GBC",
    "category": "Research & Health Sciences",
    "location": "Various",
    "applicationUrl": "https://www.google.com/search?q=2021%20Summer%20Student%20Worker%20Program-Pfizer%20application",
    "deadline": "Check program website",
    "eligibility": "Undergraduate students",
    "cost": "Contact program",
    "stipend": "Not specified",
    "source": "Summer Enrichment Program CSV"
  },
  {
    "title": "American University Pre-College Program",
    "description": "Take advantage of the opportunity to learn professional skills from American University's expert faculty! Use Washington, DC as your classroom and laboratory for experiential learning courses in communication, international studies, and politics.",
    "category": "Academic Program",
    "location": "Washington, DC",
    "applicationUrl": "https://www.american.edu/spexs/summer-programs/",
    "deadline": "Check program website",
    "eligibility": "Grades 9-12",
    "cost": "Contact program",
    "source": "High School Summer Programs PDF"
  },
  {
    "title": "Babson College Summer Study",
    "description": "Residential program for rising high school juniors and seniors that gives you real-world experience while building your business knowledge and entrepreneurial skills.",
    "category": "Business & Entrepreneurship",
    "location": "Wellesley, MA",
    "applicationUrl": "https://www.babson.edu/academics/undergraduate-school/pre-college-programs/",
    "deadline": "Check program website",
    "eligibility": "Grades 10-11",
    "cost": "Contact program",
    "source": "High School Summer Programs PDF"
  },
  {
    "title": "Boston University Summer Programs",
    "description": "Portfolio of exciting and challenging summer high school programs. Each program offers the opportunity to explore new subjects and college life while making friends with fellow students from 50 states and 87 countries.",
    "category": "Academic Program",
    "location": "Boston, MA",
    "applicationUrl": "https://www.bu.edu/summer/high-school-programs/",
    "deadline": "Check program website",
    "eligibility": "Grades 9-12",
    "cost": "Contact program",
    "source": "High School Summer Programs PDF"
  },
  {
    "title": "Brown University Pre-College Programs",
    "description": "Experience college, prepare for academic success, and make new friends from around the world. Multiple sessions 1-7 weeks in length, and more than 300 courses to choose from – on campus, online, and abroad.",
    "category": "Academic Program",
    "location": "Providence, RI",
    "applicationUrl": "https://precollege.brown.edu/",
    "deadline": "Check program website",
    "eligibility": "Grades 9-12",
    "cost": "Contact program",
    "source": "High School Summer Programs PDF"
  },
  {
    "title": "UCLA Summer Programs",
    "description": "UCLA opens its door to high school students and invites you to come and study in a welcoming environment that appreciates diversity and global perspectives.",
    "category": "Academic Program",
    "location": "Los Angeles, CA",
    "applicationUrl": "https://www.summer.ucla.edu/",
    "deadline": "Check program website",
    "eligibility": "Grades 9-12",
    "cost": "Contact program",
    "source": "High School Summer Programs PDF"
  },
  {
    "title": "UCLA Game Lab Summer Institute",
    "description": "Introduces high school students to game-making as a form of artistic practice, teaching techniques and tools to develop analog and digital games that reflect their own creative voice and vision.",
    "category": "Technology & Gaming",
    "location": "Los Angeles, CA",
    "applicationUrl": "https://games.ucla.edu/programs/summer-institute/",
    "deadline": "Check program website",
    "eligibility": "Grades 9-12",
    "cost": "Contact program",
    "source": "High School Summer Programs PDF"
  },
  {
    "title": "Carnegie Mellon University Pre-College",
    "description": "Summer Pre-College programs show you what life at Carnegie Mellon is all about - from the classroom to weekends. Meet people from all over the world, be inspired by world-renowned faculty.",
    "category": "Academic Program",
    "location": "Pittsburgh, PA",
    "applicationUrl": "https://www.cmu.edu/enrollment/pre-college/",
    "deadline": "Check program website",
    "eligibility": "Grades 10-11",
    "cost": "Contact program",
    "source": "High School Summer Programs PDF"
  },
  {
    "title": "Columbia University Summer High School Program",
    "description": "Take intensive courses especially designed for outstanding high school students, attend Columbia University classes with undergraduate students, or live and study in Barcelona or Jordan.",
    "category": "Academic Program",
    "location": "New York, NY",
    "applicationUrl": "https://www.ce.columbia.edu/high-school",
    "deadline": "Check program website",
    "eligibility": "Grades 9-12",
    "cost": "Contact program",
    "source": "High School Summer Programs PDF"
  },
  {
    "title": "Cornell University Summer College",
    "description": "Award-winning Summer College Programs offer talented high school students the opportunity to study at Cornell for three or six weeks, earn college credits, explore careers and majors.",
    "category": "Academic Program",
    "location": "Ithaca, NY",
    "applicationUrl": "https://www.sce.cornell.edu/precollege/",
    "deadline": "Check program website",
    "eligibility": "Grades 10-12",
    "cost": "Contact program",
    "source": "High School Summer Programs PDF"
  },
  {
    "title": "Harvard University Summer Programs",
    "description": "Summer programs designed to prepare you for that all-important next step—both academically and socially—paving the way for a successful college experience in Boston.",
    "category": "Academic Program",
    "location": "Cambridge, MA",
    "applicationUrl": "https://www.summer.harvard.edu/high-school-programs",
    "deadline": "Check program website",
    "eligibility": "Ages 15-18",
    "cost": "Contact program",
    "source": "High School Summer Programs PDF"
  },
  {
    "title": "Johns Hopkins Center for Talented Youth",
    "description": "CTY's summer programs offer bright students the opportunity to engage in challenging academic work in the company of peers who share their exceptional abilities and love of learning.",
    "category": "Academic Program",
    "location": "Various",
    "applicationUrl": "https://cty.jhu.edu/programs/summer/",
    "deadline": "Check program website",
    "eligibility": "Grades 9-12",
    "cost": "Contact program",
    "source": "High School Summer Programs PDF"
  },
  {
    "title": "MIT Summer Programs",
    "description": "General Summer Programs for high school students offering exciting opportunities in science, technology, engineering, and mathematics.",
    "category": "STEM",
    "location": "Cambridge, MA",
    "applicationUrl": "http://esp.mit.edu/learn/index.html",
    "deadline": "Check program website",
    "eligibility": "High school students",
    "cost": "Contact program",
    "source": "Summer Programs and Opportunities PDF"
  },
  {
    "title": "Stanford University Summer College",
    "description": "Summer College program offering intensive academic opportunities and research experiences at one of the world's leading universities.",
    "category": "Academic Program",
    "location": "Stanford, CA",
    "applicationUrl": "https://summerinstitutes.spcs.stanford.edu/",
    "deadline": "Check program website",
    "eligibility": "High school students",
    "cost": "Contact program",
    "source": "Summer Programs and Opportunities PDF"
  },
  {
    "title": "Research Science Institute (RSI)",
    "description": "Six-week, cost-free program designed to kick-start careers in science, mathematics, engineering, and technology research.",
    "category": "Research",
    "location": "Cambridge, MA",
    "applicationUrl": "http://www.cee.org/programs/rsi",
    "deadline": "Check program website",
    "eligibility": "High school students",
    "cost": "Free",
    "source": "Summer Programs and Opportunities PDF"
  },
  {
    "title": "NASA High School Aerospace Scholars",
    "description": "Interactive online learning experience highlighted by a six-day internship where students interact with engineers at NASA Johnson Space Center.",
    "category": "STEM",
    "location": "Houston, TX",
    "applicationUrl": "http://aerospacescholars.jsc.nasa.gov/abouthas.htm",
    "deadline": "Check program website",
    "eligibility": "High school juniors (age 16+)",
    "cost": "Free",
    "source": "Ivy Planners PDF"
  },
  {
    "title": "Telluride Association Summer Program (TASP)",
    "description": "Six-week educational experience for high school juniors offering challenges and rewards rarely encountered in secondary school or college (all expenses paid).",
    "category": "Leadership",
    "location": "Various",
    "applicationUrl": "http://www.tellurideassociation.org/programs/high_school_students/tasp/",
    "deadline": "Check program website",
    "eligibility": "High school juniors",
    "cost": "Free",
    "source": "Ivy Planners PDF"
  },
  {
    "title": "Bank of America Student Leaders",
    "description": "Eight-week paid internship at a nonprofit organization plus a week-long Student Leadership Summit in Washington, DC (all expenses paid).",
    "category": "Leadership",
    "location": "Various",
    "applicationUrl": "http://www.bankofamerica.com/neistudentleaders",
    "deadline": "Check program website",
    "eligibility": "High school students",
    "cost": "Free + Paid internship",
    "source": "Ivy Planners PDF"
  }
]